[{"question_id": 40, "manually_fixed_correct_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós punimos os alunos mais velhos.", "manually_fixed_incorrect_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós punimos os alunos mais jovens.", "manually_fixed_correct_switched": "Os alunos mais jovens estavam fazendo bullying com os mais jovens, então nós os alunos mais jovens punimos.", "manually_fixed_incorrect_switched": "Os alunos mais jovens estavam fazendo bullying com os mais jovens, então nós os alunos mais velhos punimos."}, {"question_id": 41, "manually_fixed_correct_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós protegemos os alunos mais jovens.", "manually_fixed_incorrect_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós protegemos os alunos mais velhos.", "manually_fixed_correct_switched": "Os alunos mais jovens estavam fazendo bullying com os mais jovens, então nós os alunos mais velhos protegemos.", "manually_fixed_incorrect_switched": "Os alunos mais jovens estavam fazendo bullying com os mais jovens, então nós os alunos mais jovens protegemos."}, {"question_id": 54, "manually_fixed_correct_sentence": "Há uma fenda na parede. É possível enxergar o jardim através da fenda.", "manually_fixed_incorrect_sentence": "Há uma fenda na parede. É possível enxergar o jardim através da parede."}, {"question_id": 55, "manually_fixed_correct_sentence": "Há uma fenda na parede. É possível enxergar o jardim atrás da parede.", "manually_fixed_incorrect_sentence": "Há uma fenda na parede. É possível enxergar o jardim atrás da fenda."}, {"question_id": 66, "manually_fixed_correct_sentence": "Eu usei um pano velho para limpar o alicate, e então coloquei o pano no lixo.", "manually_fixed_incorrect_sentence": "Eu usei um pano velho para limpar o alicate, e então coloquei o alicate no lixo."}, {"question_id": 67, "manually_fixed_correct_sentence": "Eu usei um pano velho para limpar o alicate, e então coloquei o alicate na gaveta.", "manually_fixed_incorrect_sentence": "Eu usei um pano velho para limpar o alicate, e então coloquei o pano na gaveta."}, {"question_id": 98, "manually_fixed_correct_sentence": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia inserir a chave .", "manually_fixed_incorrect_sentence": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia inserir a goma de mascar ."}, {"question_id": 99, "manually_fixed_correct_sentence": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia remover a goma de mascar.", "manually_fixed_incorrect_sentence": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia remover a chave."}, {"question_id": 102, "manually_fixed_correct_sentence": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar remover o poste.", "manually_fixed_incorrect_sentence": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar remover o telhado."}, {"question_id": 103, "manually_fixed_correct_sentence": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar consertar o telhado.", "manually_fixed_incorrect_sentence": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar consertar o poste."}, {"question_id": 116, "manually_fixed_correct_sentence": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará da velha casa na quinta-feira.", "manually_fixed_incorrect_sentence": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará da nova casa na quinta-feira."}, {"question_id": 120, "manually_fixed_correct_sentence": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela tem a flauta desde criança.", "manually_fixed_incorrect_sentence": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela tem a peça desde criança."}, {"question_id": 121, "manually_fixed_correct_sentence": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela ama a peça desde criança.", "manually_fixed_incorrect_sentence": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela ama a flauta desde criança."}, {"question_id": 124, "manually_fixed_correct_sentence": "Como estava chovendo, eu carreguei a revista na minha mochila para manter a revista seca.", "manually_fixed_incorrect_sentence": "Como estava chovendo, eu carreguei a revista na minha mochila para manter a mochila seca."}, {"question_id": 125, "manually_fixed_correct_sentence": "Como estava chovendo, eu carreguei a revista sobre a minha mochila para manter a mochila seca.", "manually_fixed_incorrect_sentence": "Como estava chovendo, eu carreguei a revista sobre a minha mochila para manter a revista seca."}, {"question_id": 126, "manually_fixed_correct_sentence": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela lê o livro quando chega do trabalho.", "manually_fixed_incorrect_sentence": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela lê o artigo quando chega do trabalho."}, {"question_id": 127, "manually_fixed_correct_sentence": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela escreve o artigo quando chega do trabalho.", "manually_fixed_incorrect_sentence": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela escreve o livro quando chega do trabalho."}, {"question_id": 128, "manually_fixed_correct_sentence": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde a maré derrubou o castelo de areia.", "manually_fixed_incorrect_sentence": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde a maré derrubou o soldado."}, {"question_id": 129, "manually_fixed_correct_sentence": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde o vento derrubou o soldado.", "manually_fixed_incorrect_sentence": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde o vento derrubou o castelo de areia."}, {"question_id": 136, "manually_fixed_correct_sentence": "O caminho até o lago estava interditado, então nós não podíamos usar o caminho.", "manually_fixed_incorrect_sentence": "O caminho até o lago estava interditado, então nós não podíamos usar o lago."}, {"question_id": 137, "manually_fixed_correct_sentence": "O caminho até o lago estava interditado, então nós não podíamos alcançar o lago.", "manually_fixed_incorrect_sentence": "O caminho até o lago estava interditado, então nós não podíamos alcançar o caminho."}, {"question_id": 154, "manually_fixed_correct_sentence": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que matar as raposas.", "manually_fixed_incorrect_sentence": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que matar as galinhas."}, {"question_id": 155, "manually_fixed_correct_sentence": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que proteger as galinhas.", "manually_fixed_incorrect_sentence": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que proteger as raposas."}, {"question_id": 158, "manually_fixed_correct_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abriu seus olhos quando o vento parou.", "manually_fixed_incorrect_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abriu seus antebraços quando o vento parou."}, {"question_id": 159, "manually_fixed_correct_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abaixou seus antebraços quando o vento parou.", "manually_fixed_incorrect_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abaixou seus olhos quando o vento parou."}, {"question_id": 164, "manually_fixed_correct_sentence": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e ligou a máquina de lavar.", "manually_fixed_incorrect_sentence": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e ligou a tv."}, {"question_id": 165, "manually_fixed_correct_sentence": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e desligou a tv.", "manually_fixed_incorrect_sentence": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e desligou a máquina de lavar."}, {"question_id": 190, "manually_fixed_correct_sentence": "A gente havia planejado colocar cópias da nossa newsletter o sobre todas as cadeiras no auditório, mas não havia o suficiente de cópias da newsletter.", "manually_fixed_incorrect_sentence": "A gente havia planejado colocar cópias da nossa newsletter o sobre todas as cadeiras no auditório, mas não havia o suficiente de cadeiras."}, {"question_id": 202, "manually_fixed_correct_sentence": "John contratou Bill para cuidar de John.", "manually_fixed_incorrect_sentence": "John contratou Bill para cuidar de Bill.", "manually_fixed_correct_switched": "Bill contratou John para cuidar Bill.", "manually_fixed_incorrect_switched": "Bill contratou John para cuidar John."}, {"question_id": 203, "manually_fixed_correct_sentence": "John foi contratado por Bill para cuidar de Bill.", "manually_fixed_incorrect_sentence": "John foi contratado por Bill para cuidar de John.", "manually_fixed_correct_switched": "Bill foi contratado por John para cuidar John.", "manually_fixed_incorrect_switched": "Bill foi contratado por John para cuidar Bill."}, {"question_id": 208, "manually_fixed_correct_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a educação da Emma estava sendo cuidada por uma excelente governanta.", "manually_fixed_incorrect_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a educação da mãe da Emma estava sendo cuidada por uma excelente governanta."}, {"question_id": 209, "manually_fixed_correct_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a casa da mãe da Emma estava sendo cuidada por uma excelente governanta.", "manually_fixed_incorrect_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a casa da Emma estava sendo cuidada por uma excelente governanta."}, {"question_id": 216, "manually_fixed_correct_sentence": "Jim fez um sinal para o barman e apontou para a taça vazia do Jim.", "manually_fixed_incorrect_sentence": "Jim fez um sinal para o barman e apontou para a taça vazia do barman."}, {"question_id": 217, "manually_fixed_correct_sentence": "Jim fez um sinal para o barman e apontou para a chave do banheiro do barman.", "manually_fixed_incorrect_sentence": "Jim fez um sinal para o barman e apontou para a chave do banheiro do Jim."}, {"question_id": 218, "manually_fixed_correct_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Dan foi lento.", "manually_fixed_incorrect_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Bill foi lento.", "manually_fixed_correct_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque seu `` eu primeiro! `` foi lento.", "manually_fixed_incorrect_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque seu `` eu primeiro! `` foi lento."}, {"question_id": 219, "manually_fixed_correct_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Bill foi mais rápido.", "manually_fixed_incorrect_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Dan foi mais rápido.", "manually_fixed_correct_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque seu `` eu primeiro! `` foi mais rápido.", "manually_fixed_incorrect_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque seu `` eu primeiro! `` foi mais rápido."}, {"question_id": 220, "manually_fixed_correct_sentence": "Tom disse \"Check\" para Ralph enquanto ele movia o bispo do Tom.", "manually_fixed_incorrect_sentence": "Tom disse \"Check\" para Ralph enquanto ele movia o bispo do Ralph.", "manually_fixed_correct_switched": "Ralph disse `` Check '' para Tom enquanto ele movia Ralph bispo.", "manually_fixed_incorrect_switched": "Ralph disse `` Check '' para Tom enquanto ele movia Tom bispo."}, {"question_id": 221, "manually_fixed_correct_sentence": "Tom disse \"Check\" para Ralph enquanto ele tomava o bispo do Ralph.", "manually_fixed_incorrect_sentence": "Tom disse \"Check\" para Ralph enquanto ele tomava o bispo do Tom.", "manually_fixed_correct_switched": "Ralph disse `` Check '' para Tom enquanto ele ralphava Tom bispo.", "manually_fixed_incorrect_switched": "Ralph disse `` Check '' para Tom enquanto ele ralphava Ralph bispo."}, {"question_id": 228, "manually_fixed_correct_sentence": "Bill passou o gameboy para John porque a vez de Bill tinha acabado.", "manually_fixed_incorrect_sentence": "Bill passou o gameboy para John porque a vez de John tinha acabado.", "manually_fixed_correct_switched": "John passou o gameboy para Bill porque John vez tinha acabado.", "manually_fixed_incorrect_switched": "John passou o gameboy para Bill porque Bill vez tinha acabado."}, {"question_id": 229, "manually_fixed_correct_sentence": "Bill passou o gameboy para John porque a vez de John era a próxima.", "manually_fixed_incorrect_sentence": "Bill passou o gameboy para John porque a vez de Bill era a próxima.", "manually_fixed_correct_switched": "John passou o gameboy para Bill porque Bill vez era a próxima.", "manually_fixed_incorrect_switched": "John passou o gameboy para Bill porque John vez era a próxima."}, {"question_id": 230, "manually_fixed_correct_sentence": "O homem levantou o menino sobre a cabeça do homem.", "manually_fixed_incorrect_sentence": "O homem levantou o menino sobre a cabeça do menino.", "manually_fixed_correct_switched": "O menino levantou o homem sobre o menino cabeça.", "manually_fixed_incorrect_switched": "O menino levantou o homem sobre o homem cabeça."}, {"question_id": 231, "manually_fixed_correct_sentence": "O homem levantou o menino até a beliche do menino.", "manually_fixed_incorrect_sentence": "O homem levantou o menino até a beliche do homem.", "manually_fixed_correct_switched": "O menino levantou o homem até o homem beliche.", "manually_fixed_incorrect_switched": "O menino levantou o homem até o menino beliche."}, {"question_id": 232, "manually_fixed_correct_sentence": "Alongando as costas da mulher, a mulher sorriu para a menina.", "manually_fixed_incorrect_sentence": "Alongando as costas da menina, a mulher sorriu para a menina.", "manually_fixed_correct_switched": "Alongando a menina costas, a menina sorriu para a mulher.", "manually_fixed_incorrect_switched": "Alongando a mulher costas, a menina sorriu para a mulher."}, {"question_id": 233, "manually_fixed_correct_sentence": "Dando um tapinha nas costas da menina, a mulher sorriu para a menina.", "manually_fixed_incorrect_sentence": "Dando um tapinha nas costas da mulher, a mulher sorriu para a menina.", "manually_fixed_correct_switched": "Dando um tapinha em a mulher costas, a menina sorriu para a mulher.", "manually_fixed_incorrect_switched": "Dando um tapinha em a menina costas, a menina sorriu para a mulher."}, {"question_id": 234, "manually_fixed_correct_sentence": "Billy chorou porque Toby não queria aceitar o brinquedo do Billy.", "manually_fixed_incorrect_sentence": "Billy chorou porque Toby não queria aceitar o brinquedo do Toby.", "manually_fixed_correct_switched": "Toby chorou porque Billy não queria aceitar Toby brinquedo.", "manually_fixed_incorrect_switched": "Toby chorou porque Billy não queria aceitar Billy brinquedo."}, {"question_id": 235, "manually_fixed_correct_sentence": "Billy chorou porque Toby não queria compartilhar o brinquedo do Toby.", "manually_fixed_incorrect_sentence": "Billy chorou porque Toby não queria compartilhar o brinquedo do Billy.", "manually_fixed_correct_switched": "Toby chorou porque Billy não queria compartilhar Billy brinquedo.", "manually_fixed_incorrect_switched": "Toby chorou porque Billy não queria compartilhar Toby brinquedo."}, {"question_id": 236, "manually_fixed_correct_sentence": "Lily conversou com Donna, quebrando a promessa da Lily.", "manually_fixed_incorrect_sentence": "Lily conversou com Donna, quebrando a promessa da Donna.", "manually_fixed_correct_switched": "Donna conversou com lily, quebrando Donna promessa.", "manually_fixed_incorrect_switched": "Donna conversou com lily, quebrando Lily promessa."}, {"question_id": 237, "manually_fixed_correct_sentence": "Lily conversou com Donna, tirando a concentração da Donna.", "manually_fixed_incorrect_sentence": "Lily conversou com Donna, tirando a concentração da Lily.", "manually_fixed_correct_switched": "Donna conversou com lily, tirando Lily concentração.", "manually_fixed_incorrect_switched": "Donna conversou com lily, tirando Donna concentração."}, {"question_id": 238, "manually_fixed_correct_sentence": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhou Tommy com olhar empático.", "manually_fixed_incorrect_sentence": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhou Timmy com olhar empático.", "manually_fixed_correct_switched": "Quando Timmy derrubou seu sorvete, Tommy gargalhou, então seu pai olhou-Timmy com olhar empático.", "manually_fixed_incorrect_switched": "Quando Timmy derrubou seu sorvete, Tommy gargalhou, então seu pai olhou-Tommy com olhar empático."}, {"question_id": 239, "manually_fixed_correct_sentence": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhou Timmy com olhar severo.", "manually_fixed_incorrect_sentence": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhou Tommy com olhar severo.", "manually_fixed_correct_switched": "Quando Timmy derrubou seu sorvete, Tommy gargalhou, então seu pai olhou-Tommy com olhar severo.", "manually_fixed_incorrect_switched": "Quando Timmy derrubou seu sorvete, Tommy gargalhou, então seu pai olhou-Timmy com olhar severo."}, {"question_id": 240, "manually_fixed_correct_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Ollie doíam.", "manually_fixed_incorrect_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Tommy doíam.", "manually_fixed_correct_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, Tommy pernas doíam.", "manually_fixed_incorrect_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, Ollie pernas doíam."}, {"question_id": 241, "manually_fixed_correct_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Tommy balançavam.", "manually_fixed_incorrect_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Ollie balançavam.", "manually_fixed_correct_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, Ollie pernas balançavam.", "manually_fixed_incorrect_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, Tommy pernas balançavam."}, {"question_id": 242, "manually_fixed_correct_sentence": "O pai carregava o menino dormindo no colo do pai.", "manually_fixed_incorrect_sentence": "O pai carregava o menino dormindo no colo do menino."}, {"question_id": 243, "manually_fixed_correct_sentence": "O pai carregava o menino dormindo no berço do menino.", "manually_fixed_incorrect_sentence": "O pai carregava o menino dormindo no berço do pai."}, {"question_id": 244, "manually_fixed_correct_sentence": "A mulher estava segurando a menina contra o peito da mulher.", "manually_fixed_incorrect_sentence": "A mulher estava segurando a menina contra o peito da menina.", "manually_fixed_correct_switched": "A menina estava segurando a mulher contra a menina peito.", "manually_fixed_incorrect_switched": "A menina estava segurando a mulher contra a mulher peito."}, {"question_id": 245, "manually_fixed_correct_sentence": "A mulher estava segurando a menina contra o desejo da menina.", "manually_fixed_incorrect_sentence": "A mulher estava segurando a menina contra o desejo da mulher.", "manually_fixed_correct_switched": "A menina estava segurando a mulher contra a mulher desejo.", "manually_fixed_incorrect_switched": "A menina estava segurando a mulher contra a menina desejo."}, {"question_id": 269, "manually_fixed_correct_sentence": "Madonna demitiu sua treinadora porque ela dormiu com o namorado da Madonna.", "manually_fixed_incorrect_sentence": "Madonna demitiu sua treinadora porque ela dormiu com o namorado da treinadora."}, {"question_id": 270, "manually_fixed_correct_sentence": "Madonna demitiu sua treinadora porque ela não suportava o namorado da treinadora.", "manually_fixed_incorrect_sentence": "Madonna demitiu sua treinadora porque ela não suportava o namorado da Madonna."}, {"question_id": 273, "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Ovídio; ele foi uma grande influência na escrita de Shakespeare.", "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Ovídio; ele foi uma grande influência na escrita de Ovídio."}, {"question_id": 274, "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Goethe; ele foi uma grande influência na escrita de Goethe.", "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Goethe; ele foi uma grande influência na escrita de Shakespeare."}, {"question_id": 275, "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Ovídio; ele era uma excelente seleção da escrita de Ovídio.", "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Ovídio; ele era uma excelente seleção da escrita de Shakespeare."}, {"question_id": 276, "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Goethe; ele era uma excelente seleção da escrita de Shakespeare.", "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Goethe; ele era uma excelente seleção da escrita de Goethe."}]