[{"question_id": 0, "substitution": "Os vereadores recusaram a autorização aos manifestantes porque os vereadores temiam a violência.", "correctness": true}, {"question_id": 0, "substitution": "Os vereadores recusaram a autorização aos manifestantes porque os manifestantes temiam a violência.", "correctness": false}, {"question_id": 1, "substitution": "Os vereadores recusaram a autorização aos manifestantes porque os manifestantes eram favoráveis à violência.", "correctness": true}, {"question_id": 1, "substitution": "Os vereadores recusaram a autorização aos manifestantes porque os vereadores eram favoráveis à violência.", "correctness": false}, {"question_id": 2, "substitution": "A medalha não cabe na maleta porque a medalha é muito grande.", "correctness": true}, {"question_id": 2, "substitution": "A medalha não cabe na maleta porque a maleta é muito grande.", "correctness": false}, {"question_id": 3, "substitution": "A medalha não cabe na maleta porque a maleta é muito pequena.", "correctness": true}, {"question_id": 3, "substitution": "A medalha não cabe na maleta porque a medalha é muito pequena.", "correctness": false}, {"question_id": 4, "substitution": "Joan certificou-se de agradecer Susan por toda ajuda que Joan havia recebido.", "correctness": true}, {"question_id": 4, "substitution": "Joan certificou-se de agradecer Susan por toda ajuda que Susan havia recebido.", "correctness": false}, {"question_id": 5, "substitution": "Joan certificou-se de agradecer Susan por toda ajuda que Joan havia oferecido.", "correctness": true}, {"question_id": 5, "substitution": "Joan certificou-se de agradecer Susan por toda ajuda que Susan havia oferecido.", "correctness": false}, {"question_id": 6, "substitution": "Paul tentou ligar para o George, mas Paul não foi bem sucedido.", "correctness": true}, {"question_id": 6, "substitution": "Paul tentou ligar para o George, mas George não foi bem sucedido.", "correctness": false}, {"question_id": 7, "substitution": "Paul tentou ligar para o George, mas George não estava disponível.", "correctness": true}, {"question_id": 7, "substitution": "Paul tentou ligar para o George, mas Paul não estava disponível.", "correctness": false}, {"question_id": 8, "substitution": "O advogado fez uma pergunta ao juiz, mas o advogado estava relutante em repeti-la.", "correctness": true}, {"question_id": 8, "substitution": "O advogado fez uma pergunta ao juiz, mas o juiz estava relutante em repeti-la.", "correctness": false}, {"question_id": 9, "substitution": "O advogado fez uma pergunta ao juiz, mas o juiz estava relutante em respondê-la.", "correctness": true}, {"question_id": 9, "substitution": "O advogado fez uma pergunta ao juiz, mas o advogado estava relutante em respondê-la.", "correctness": false}, {"question_id": 10, "substitution": "O caminhão de entregas passou rapidamente pelo ônibus escolar porque o caminhão de entregas estava indo muito depressa.", "correctness": true}, {"question_id": 10, "substitution": "O caminhão de entregas passou rapidamente pelo ônibus escolar porque o ônibus escolar estava indo muito depressa.", "correctness": false}, {"question_id": 11, "substitution": "O caminhão de entregas passou rapidamente pelo ônibus escolar porque o ônibus escolar estava indo muito devagar.", "correctness": true}, {"question_id": 11, "substitution": "O caminhão de entregas passou rapidamente pelo ônibus escolar porque o caminhão de entregas estava indo muito devagar.", "correctness": false}, {"question_id": 12, "substitution": "Frank sentiu-se vingado quando seu rival de longa data Bill revelou que Frank era o vencedor da competição.", "correctness": true}, {"question_id": 12, "substitution": "Frank sentiu-se vingado quando seu rival de longa data Bill revelou que Bill era o vencedor da competição.", "correctness": false}, {"question_id": 13, "substitution": "Frank sentiu-se fracassado quando seu rival de longa data Bill revelou que Bill era o vencedor da competição.", "correctness": true}, {"question_id": 13, "substitution": "Frank sentiu-se fracassado quando seu rival de longa data Bill revelou que Frank era o vencedor da competição.", "correctness": false}, {"question_id": 14, "substitution": "O homem não conseguia erguer seu filho porque o homem era muito fraco.", "correctness": true}, {"question_id": 14, "substitution": "O homem não conseguia erguer seu filho porque o filho era muito fraco.", "correctness": false}, {"question_id": 15, "substitution": "O homem não conseguia erguer seu filho porque o filho era muito pesado.", "correctness": true}, {"question_id": 15, "substitution": "O homem não conseguia erguer seu filho porque o homem era muito pesado.", "correctness": false}, {"question_id": 16, "substitution": "A grande bola atravessou pela mesa pois a grande bola era feita de aço.", "correctness": true}, {"question_id": 16, "substitution": "A grande bola atravessou pela mesa pois a mesa era feita de aço.", "correctness": false}, {"question_id": 17, "substitution": "A grande bola atravessou pela mesa pois a mesa era feita de isopor.", "correctness": true}, {"question_id": 17, "substitution": "A grande bola atravessou pela mesa pois a grande bola era feita de isopor.", "correctness": false}, {"question_id": 18, "substitution": "John não conseguia enxergar o palco com Billy na sua frente porque John é muito baixo.", "correctness": true}, {"question_id": 18, "substitution": "John não conseguia enxergar o palco com Billy na sua frente porque Billy é muito baixo.", "correctness": false}, {"question_id": 19, "substitution": "John não conseguia enxergar o palco com Billy na sua frente porque Billy é muito alto.", "correctness": true}, {"question_id": 19, "substitution": "John não conseguia enxergar o palco com Billy na sua frente porque John é muito alto.", "correctness": false}, {"question_id": 20, "substitution": "Tom jogou sua mochila para o Ray lá embaixo depois que Tom atingiu o topo da escada.", "correctness": true}, {"question_id": 20, "substitution": "Tom jogou sua mochila para o Ray lá embaixo depois que Ray atingiu o topo da escada.", "correctness": false}, {"question_id": 21, "substitution": "Tom jogou sua mochila para o Ray lá embaixo depois que Ray atingiu a parte inferior da escada.", "correctness": true}, {"question_id": 21, "substitution": "Tom jogou sua mochila para o Ray lá embaixo depois que Tom atingiu a parte inferior da escada.", "correctness": false}, {"question_id": 22, "substitution": "Apesar de ambas correrem a aproximadamente a mesma velocidade, Sue derrotou Sally porque Sue começou muito bem.", "correctness": true}, {"question_id": 22, "substitution": "Apesar de ambas correrem a aproximadamente a mesma velocidade, Sue derrotou Sally porque Sally começou muito bem.", "correctness": false}, {"question_id": 23, "substitution": "Apesar de ambas correrem a aproximadamente a mesma velocidade, Sue derrotou Sally porque Sally começou muito mal.", "correctness": true}, {"question_id": 23, "substitution": "Apesar de ambas correrem a aproximadamente a mesma velocidade, Sue derrotou Sally porque Sue começou muito mal.", "correctness": false}, {"question_id": 24, "substitution": "A escultura caiu da prateleira porque a escultura não estava bem acomodada.", "correctness": true}, {"question_id": 24, "substitution": "A escultura caiu da prateleira porque a prateleira não estava bem acomodada.", "correctness": false}, {"question_id": 25, "substitution": "A escultura caiu da prateleira porque a prateleira não estava bem nivelada.", "correctness": true}, {"question_id": 25, "substitution": "A escultura caiu da prateleira porque a escultura não estava bem nivelada.", "correctness": false}, {"question_id": 26, "substitution": "O desenho do Sam estava pendurado imediatamente acima do da Tina e o desenho do Sam de fato ficava muito melhor com outro abaixo dele.", "correctness": true}, {"question_id": 26, "substitution": "O desenho do Sam estava pendurado imediatamente acima do da Tina e o desenho da Tina de fato ficava muito melhor com outro abaixo dele.", "correctness": false}, {"question_id": 27, "substitution": "O desenho do Sam estava pendurado imediatamente acima do da Tina e o desenho da Tina de fato ficava muito melhor com outro acima dele.", "correctness": true}, {"question_id": 27, "substitution": "O desenho do Sam estava pendurado imediatamente acima do da Tina e o desenho do Sam de fato ficava muito melhor com outro acima dele.", "correctness": false}, {"question_id": 28, "substitution": "Anna se saiu muito melhor do que sua amiga Lucy na prova porque Anna tinha estudado muito.", "correctness": true}, {"question_id": 28, "substitution": "Anna se saiu muito melhor do que sua amiga Lucy na prova porque Lucy tinha estudado muito.", "correctness": false}, {"question_id": 29, "substitution": "Anna se saiu muito pior do que sua amiga Lucy na prova porque Lucy tinha estudado muito.", "correctness": true}, {"question_id": 29, "substitution": "Anna se saiu muito pior do que sua amiga Lucy na prova porque Anna tinha estudado muito.", "correctness": false}, {"question_id": 30, "substitution": "Os bombeiros chegaram depois dos policiais porque os bombeiros estavam vindo de muito longe.", "correctness": true}, {"question_id": 30, "substitution": "Os bombeiros chegaram depois dos policiais porque os policiais estavam vindo de muito longe.", "correctness": false}, {"question_id": 31, "substitution": "Os bombeiros chegaram antes dos policiais porque os policiais estavam vindo de muito longe.", "correctness": true}, {"question_id": 31, "substitution": "Os bombeiros chegaram antes dos policiais porque os bombeiros estavam vindo de muito longe.", "correctness": false}, {"question_id": 32, "substitution": "Frank estava chateado com o Tom porque a torradeira que Frank havia comprado dele não funcionava.", "correctness": true}, {"question_id": 32, "substitution": "Frank estava chateado com o Tom porque a torradeira que Tom havia comprado dele não funcionava.", "correctness": false}, {"question_id": 33, "substitution": "Frank estava chateado com o Tom porque a torradeira que Tom havia vendido para ele não funcionava.", "correctness": true}, {"question_id": 33, "substitution": "Frank estava chateado com o Tom porque a torradeira que Frank havia vendido para ele não funcionava.", "correctness": false}, {"question_id": 34, "substitution": "Jim gritou com Kevin porque Jim estava muito transtornado.", "correctness": true}, {"question_id": 34, "substitution": "Jim gritou com Kevin porque Kevin estava muito transtornado.", "correctness": false}, {"question_id": 35, "substitution": "Jim reconfortou Kevin porque Kevin estava muito transtornado.", "correctness": true}, {"question_id": 35, "substitution": "Jim reconfortou Kevin porque Jim estava muito transtornado.", "correctness": false}, {"question_id": 36, "substitution": "O saco de batatas havia sido colocado em cima do saco de farinha, portanto o saco de batatas tinha que ser retirado antes.", "correctness": true}, {"question_id": 36, "substitution": "O saco de batatas havia sido colocado em cima do saco de farinha, portanto o saco de farinha tinha que ser retirado antes.", "correctness": false}, {"question_id": 37, "substitution": "O saco de batatas havia sido colocado embaixo do saco de farinha, portanto o saco de farinha tinha que ser retirado antes.", "correctness": true}, {"question_id": 37, "substitution": "O saco de batatas havia sido colocado embaixo do saco de farinha, portanto o saco de batatas tinha que ser retirado antes.", "correctness": false}, {"question_id": 38, "substitution": "Pete tem inveja de Martin apesar de Pete ser muito bem sucedido.", "correctness": true}, {"question_id": 38, "substitution": "Pete tem inveja de Martin apesar de Martin ser muito bem sucedido.", "correctness": false}, {"question_id": 39, "substitution": "Pete tem inveja de Martin porque Martin é muito bem sucedido.", "correctness": true}, {"question_id": 39, "substitution": "Pete tem inveja de Martin porque Pete é muito bem sucedido.", "correctness": false}, {"question_id": 40, "substitution": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós os alunos mais velhos punimos.", "correctness": true}, {"question_id": 40, "substitution": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós os alunos mais jovens punimos.", "correctness": false}, {"question_id": 41, "substitution": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós os alunos mais jovens protegemos.", "correctness": true}, {"question_id": 41, "substitution": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós os alunos mais velhos protegemos.", "correctness": false}, {"question_id": 42, "substitution": "Eu servi a água da garrafa na xícara até que a garrafa ficasse vazia.", "correctness": true}, {"question_id": 42, "substitution": "Eu servi a água da garrafa na xícara até que a xícara ficasse vazia.", "correctness": false}, {"question_id": 43, "substitution": "Eu servi a água da garrafa na xícara até que a xícara ficasse cheia.", "correctness": true}, {"question_id": 43, "substitution": "Eu servi a água da garrafa na xícara até que a garrafa ficasse cheia.", "correctness": false}, {"question_id": 44, "substitution": "Susan sabe tudo sobre os problemas pessoais da Ann porque Susan é intrometida.", "correctness": true}, {"question_id": 44, "substitution": "Susan sabe tudo sobre os problemas pessoais da Ann porque Ann é intrometida.", "correctness": false}, {"question_id": 45, "substitution": "Susan sabe tudo sobre os problemas pessoais da Ann porque Ann é indiscreta.", "correctness": true}, {"question_id": 45, "substitution": "Susan sabe tudo sobre os problemas pessoais da Ann porque Susan é indiscreta.", "correctness": false}, {"question_id": 46, "substitution": "Sid explicou sua teoria para o Mark mas Sid não conseguiu convencê-lo.", "correctness": true}, {"question_id": 46, "substitution": "Sid explicou sua teoria para o Mark mas Mark não conseguiu convencê-lo.", "correctness": false}, {"question_id": 47, "substitution": "Sid explicou sua teoria para o Mark mas Mark não conseguiu compreendê-la.", "correctness": true}, {"question_id": 47, "substitution": "Sid explicou sua teoria para o Mark mas Sid não conseguiu compreendê-la.", "correctness": false}, {"question_id": 48, "substitution": "Susan sabia que o filho de Ann havia se envolvido em um acidente de carro, então Susan contou-lhe a respeito.", "correctness": true}, {"question_id": 48, "substitution": "Susan sabia que o filho de Ann havia se envolvido em um acidente de carro, então Ann contou-lhe a respeito.", "correctness": false}, {"question_id": 49, "substitution": "Susan sabia que o filho de Ann havia se envolvido em um acidente de carro, porque Ann contou-lhe a respeito.", "correctness": true}, {"question_id": 49, "substitution": "Susan sabia que o filho de Ann havia se envolvido em um acidente de carro, porque Susan contou-lhe a respeito.", "correctness": false}, {"question_id": 50, "substitution": "O tio do Joe ainda consegue derrotá-lo no tênis, apesar de Joe ser 30 anos mais jovem.", "correctness": true}, {"question_id": 50, "substitution": "O tio do Joe ainda consegue derrotá-lo no tênis, apesar de o tio do Joe ser 30 anos mais jovem.", "correctness": false}, {"question_id": 51, "substitution": "O tio do Joe ainda consegue derrotá-lo no tênis, apesar de o tio do Joe ser 30 anos mais velho.", "correctness": true}, {"question_id": 51, "substitution": "O tio do Joe ainda consegue derrotá-lo no tênis, apesar de Joe ser 30 anos mais velho.", "correctness": false}, {"question_id": 52, "substitution": "O quadro na sala de estar do Mark mostra um carvalho. O quadro está à direita da estante de livros.", "correctness": true}, {"question_id": 52, "substitution": "O quadro na sala de estar do Mark mostra um carvalho. O carvalho está à direita da estante de livros.", "correctness": false}, {"question_id": 53, "substitution": "O quadro na sala de estar do Mark mostra um carvalho. O carvalho está à direita da casa.", "correctness": true}, {"question_id": 53, "substitution": "O quadro na sala de estar do Mark mostra um carvalho. O quadro está à direita da casa.", "correctness": false}, {"question_id": 54, "substitution": "Há uma fenda na parede. É possível enxergar o jardim através a fenda.", "correctness": true}, {"question_id": 54, "substitution": "Há uma fenda na parede. É possível enxergar o jardim através a parede.", "correctness": false}, {"question_id": 55, "substitution": "Há uma fenda na parede. É possível enxergar o jardim atrás a parede.", "correctness": true}, {"question_id": 55, "substitution": "Há uma fenda na parede. É possível enxergar o jardim atrás a fenda.", "correctness": false}, {"question_id": 56, "substitution": "O ralo está entupido com cabelo. O ralo tem que ser limpado.", "correctness": true}, {"question_id": 56, "substitution": "O ralo está entupido com cabelo. O cabelo tem que ser limpado.", "correctness": false}, {"question_id": 57, "substitution": "O ralo está entupido com cabelo. O cabelo tem que ser removido.", "correctness": true}, {"question_id": 57, "substitution": "O ralo está entupido com cabelo. O ralo tem que ser removido.", "correctness": false}, {"question_id": 58, "substitution": "Meu compromisso começava às 4:00 e eu precisava pegar o trem às 4:30, portanto não havia muito tempo. Felizmente, meu compromisso foi breve, então tudo deu certo.", "correctness": true}, {"question_id": 58, "substitution": "Meu compromisso começava às 4:00 e eu precisava pegar o trem às 4:30, portanto não havia muito tempo. Felizmente, o trem foi breve, então tudo deu certo.", "correctness": false}, {"question_id": 59, "substitution": "Meu compromisso começava às 4:00 e eu precisava pegar o trem às 4:30, portanto não havia muito tempo. Felizmente, o trem atrasou, então tudo deu certo.", "correctness": true}, {"question_id": 59, "substitution": "Meu compromisso começava às 4:00 e eu precisava pegar o trem às 4:30, portanto não havia muito tempo. Felizmente, meu compromisso atrasou, então tudo deu certo.", "correctness": false}, {"question_id": 60, "substitution": "Durante a apresentação a céu aberto, começou a chover, mas a apresentação continuou até às 10.", "correctness": true}, {"question_id": 60, "substitution": "Durante a apresentação a céu aberto, começou a chover, mas a chuva continuou até às 10.", "correctness": false}, {"question_id": 61, "substitution": "Durante a apresentação a céu aberto, começou a chover, e a chuva continuou até às 10.", "correctness": true}, {"question_id": 61, "substitution": "Durante a apresentação a céu aberto, começou a chover, e a apresentação continuou até às 10.", "correctness": false}, {"question_id": 62, "substitution": "Eu usei um pano velho para limpar o alicate, e então o pano coloquei no lixo.", "correctness": true}, {"question_id": 62, "substitution": "Eu usei um pano velho para limpar o alicate, e então o alicate coloquei no lixo.", "correctness": false}, {"question_id": 63, "substitution": "Eu usei um pano velho para limpar o alicate, e então o alicate coloquei na gaveta.", "correctness": true}, {"question_id": 63, "substitution": "Eu usei um pano velho para limpar o alicate, e então o pano coloquei na gaveta.", "correctness": false}, {"question_id": 64, "substitution": "Ann perguntou a Mary a que horas a biblioteca fechava, porque Ann havia esquecido.", "correctness": true}, {"question_id": 64, "substitution": "Ann perguntou a Mary a que horas a biblioteca fechava, porque Mary havia esquecido.", "correctness": false}, {"question_id": 65, "substitution": "Ann perguntou a Mary a que horas a biblioteca fechava, mas Mary havia esquecido.", "correctness": true}, {"question_id": 65, "substitution": "Ann perguntou a Mary a que horas a biblioteca fechava, mas Ann havia esquecido.", "correctness": false}, {"question_id": 66, "substitution": "Eu retirei a garrafa d'água da mochila para que a garrafa d'água ficasse acessível.", "correctness": true}, {"question_id": 66, "substitution": "Eu retirei a garrafa d'água da mochila para que a mochila ficasse acessível.", "correctness": false}, {"question_id": 67, "substitution": "Eu retirei a garrafa d'água da mochila para que a mochila ficasse leve.", "correctness": true}, {"question_id": 67, "substitution": "Eu retirei a garrafa d'água da mochila para que a garrafa d'água ficasse leve.", "correctness": false}, {"question_id": 68, "substitution": "Tenho certeza que meu mapa mostrará esse prédio; o mapa é muito bom.", "correctness": true}, {"question_id": 68, "substitution": "Tenho certeza que meu mapa mostrará esse prédio; o prédio é muito bom.", "correctness": false}, {"question_id": 69, "substitution": "Tenho certeza que meu mapa mostrará esse prédio; o prédio é muito famoso.", "correctness": true}, {"question_id": 69, "substitution": "Tenho certeza que meu mapa mostrará esse prédio; o mapa é muito famoso.", "correctness": false}, {"question_id": 70, "substitution": "Bob custeou o ensino superior de Charlie. Bob é muito generoso.", "correctness": true}, {"question_id": 70, "substitution": "Bob custeou o ensino superior de Charlie. Charlie é muito generoso.", "correctness": false}, {"question_id": 71, "substitution": "Bob custeou o ensino superior de Charlie. Charlie é muito grato.", "correctness": true}, {"question_id": 71, "substitution": "Bob custeou o ensino superior de Charlie. Bob é muito grato.", "correctness": false}, {"question_id": 72, "substitution": "Bob custeou o ensino superior de Charlie, mas agora Charlie age como se isso nunca houvesse acontecido. Bob está muito magoado.", "correctness": true}, {"question_id": 72, "substitution": "Bob custeou o ensino superior de Charlie, mas agora Charlie age como se isso nunca houvesse acontecido. Charlie está muito magoado.", "correctness": false}, {"question_id": 73, "substitution": "Bob custeou o ensino superior de Charlie, mas agora Charlie age como se isso nunca houvesse acontecido. Charlie é muito ingrato.", "correctness": true}, {"question_id": 73, "substitution": "Bob custeou o ensino superior de Charlie, mas agora Charlie age como se isso nunca houvesse acontecido. Bob é muito ingrato.", "correctness": false}, {"question_id": 74, "substitution": "Bob estava jogando cartas com Adam e estava muito à frente no placar. Se Adam não tivesse tido uma sequência de jogadas de sorte, Bob teria ganhado.", "correctness": true}, {"question_id": 74, "substitution": "Bob estava jogando cartas com Adam e estava muito à frente no placar. Se Adam não tivesse tido uma sequência de jogadas de sorte, Adam teria ganhado.", "correctness": false}, {"question_id": 75, "substitution": "Bob estava jogando cartas com Adam e estava muito à frente no placar. Se Adam não tivesse tido uma sequência de jogadas de sorte, Adam teria perdido.", "correctness": true}, {"question_id": 75, "substitution": "Bob estava jogando cartas com Adam e estava muito à frente no placar. Se Adam não tivesse tido uma sequência de jogadas de sorte, Bob teria perdido.", "correctness": false}, {"question_id": 76, "substitution": "Adam não pode sair do trabalho até que Bob chegue para substituí-lo. Se Bob tivesse saído de casa na hora certa, Adam já teria saído agora.", "correctness": true}, {"question_id": 76, "substitution": "Adam não pode sair do trabalho até que Bob chegue para substituí-lo. Se Bob tivesse saído de casa na hora certa, Bob já teria saído agora.", "correctness": false}, {"question_id": 77, "substitution": "Adam não pode sair do trabalho até que Bob chegue para substituí-lo. Se Bob tivesse saído de casa na hora certa, Bob já estaria aqui agora.", "correctness": true}, {"question_id": 77, "substitution": "Adam não pode sair do trabalho até que Bob chegue para substituí-lo. Se Bob tivesse saído de casa na hora certa, Adam já estaria aqui agora.", "correctness": false}, {"question_id": 78, "substitution": "Se o golpista tivesse sido bem sucedido em enganar o Sam, o golpista teria ganhado muito dinheiro.", "correctness": true}, {"question_id": 78, "substitution": "Se o golpista tivesse sido bem sucedido em enganar o Sam, Sam teria ganhado muito dinheiro.", "correctness": false}, {"question_id": 79, "substitution": "Se o golpista tivesse sido bem sucedido em enganar o Sam, Sam teria perdido muito dinheiro.", "correctness": true}, {"question_id": 79, "substitution": "Se o golpista tivesse sido bem sucedido em enganar o Sam, o golpista teria perdido muito dinheiro.", "correctness": false}, {"question_id": 80, "substitution": "O gato estava esperando próximo ao buraco esperando pelo rato, mas o gato estava muito impaciente.", "correctness": true}, {"question_id": 80, "substitution": "O gato estava esperando próximo ao buraco esperando pelo rato, mas o rato estava muito impaciente.", "correctness": false}, {"question_id": 81, "substitution": "O gato estava esperando próximo ao buraco esperando pelo rato, mas o rato era muito cauteloso.", "correctness": true}, {"question_id": 81, "substitution": "O gato estava esperando próximo ao buraco esperando pelo rato, mas o gato era muito cauteloso.", "correctness": false}, {"question_id": 82, "substitution": "Anne deu à luz uma menina mês passado. Anne é uma mulher encantadora.", "correctness": true}, {"question_id": 82, "substitution": "Anne deu à luz uma menina mês passado. A filha da Anne é uma mulher encantadora.", "correctness": false}, {"question_id": 83, "substitution": "Anne deu à luz uma menina mês passado. A filha da Anne é uma bebê encantadora.", "correctness": true}, {"question_id": 83, "substitution": "Anne deu à luz uma menina mês passado. Anne é uma bebê encantadora.", "correctness": false}, {"question_id": 84, "substitution": "Alice tentou incansavelmente impedir sua filha de conversar na festa. Ficamos nos questionando porque Alice estava se comportando de maneira tão estranha.", "correctness": true}, {"question_id": 84, "substitution": "Alice tentou incansavelmente impedir sua filha de conversar na festa. Ficamos nos questionando porque a filha da Alice estava se comportando de maneira tão estranha.", "correctness": false}, {"question_id": 85, "substitution": "Alice tentou incansavelmente impedir sua filha de latir na festa. Ficamos nos questionando porque a filha da Alice estava se comportando de maneira tão estranha.", "correctness": true}, {"question_id": 85, "substitution": "Alice tentou incansavelmente impedir sua filha de latir na festa. Ficamos nos questionando porque Alice estava se comportando de maneira tão estranha.", "correctness": false}, {"question_id": 86, "substitution": "Eu vi o Jim gritando com um cara que vestia uma farda e tinha uma grande barba ruiva. Eu não sei porque Jim estava assim, mas ele parecia muito chateado.", "correctness": true}, {"question_id": 86, "substitution": "Eu vi o Jim gritando com um cara que vestia uma farda e tinha uma grande barba ruiva. Eu não sei porque o cara que vestia uma farda estava assim, mas ele parecia muito chateado.", "correctness": false}, {"question_id": 87, "substitution": "Eu vi o Jim gritando com um cara que vestia uma farda e tinha uma grande barba ruiva. Eu não sei quem o cara que vestia uma farda era, mas ele parecia muito chateado.", "correctness": true}, {"question_id": 87, "substitution": "Eu vi o Jim gritando com um cara que vestia uma farda e tinha uma grande barba ruiva. Eu não sei quem Jim era, mas ele parecia muito chateado.", "correctness": false}, {"question_id": 88, "substitution": "O peixe comeu o mosquito. O peixe estava com fome.", "correctness": true}, {"question_id": 88, "substitution": "O peixe comeu o mosquito. O mosquito estava com fome.", "correctness": false}, {"question_id": 89, "substitution": "O peixe comeu o mosquito. O mosquito estava saboroso.", "correctness": true}, {"question_id": 89, "substitution": "O peixe comeu o mosquito. O peixe estava saboroso.", "correctness": false}, {"question_id": 90, "substitution": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia inseri-a chave .", "correctness": true}, {"question_id": 90, "substitution": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia inseri-a goma de mascar .", "correctness": false}, {"question_id": 91, "substitution": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia removê-a goma de mascar.", "correctness": true}, {"question_id": 91, "substitution": "Eu estava tentando abrir o cadeado com a chave, mas alguém havia preenchido a fechadura com goma de mascar, e eu não conseguia removê-a chave.", "correctness": false}, {"question_id": 92, "substitution": "O cão perseguiu o gato, que correu até a árvore. O cão esperou embaixo.", "correctness": true}, {"question_id": 92, "substitution": "O cão perseguiu o gato, que correu até a árvore. O gato esperou embaixo.", "correctness": false}, {"question_id": 93, "substitution": "O cão perseguiu o gato, que correu até a árvore. O gato esperou em cima.", "correctness": true}, {"question_id": 93, "substitution": "O cão perseguiu o gato, que correu até a árvore. O cão esperou em cima.", "correctness": false}, {"question_id": 94, "substitution": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar removêo poste.", "correctness": true}, {"question_id": 94, "substitution": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar removêo telhado.", "correctness": false}, {"question_id": 95, "substitution": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar consertáo telhado.", "correctness": true}, {"question_id": 95, "substitution": "Durante a tempestade, o poste caiu e atravessou o telhado da minha casa. Agora, eu tenho que mandar consertáo posto.", "correctness": false}, {"question_id": 96, "substitution": "O cliente entrou no banco e esfaqueou um dos caixas. O cliente foi levado imediatamente para a delegacia.", "correctness": true}, {"question_id": 96, "substitution": "O cliente entrou no banco e esfaqueou um dos caixas. O caixa foi levado imediatamente para a delegacia.", "correctness": false}, {"question_id": 97, "substitution": "O cliente entrou no banco e esfaqueou um dos caixas. O caixa foi levado imediatamente para o hospital.", "correctness": true}, {"question_id": 97, "substitution": "O cliente entrou no banco e esfaqueou um dos caixas. O cliente foi levado imediatamente para o hospital.", "correctness": false}, {"question_id": 98, "substitution": "John estava fazendo uma pesquisa na biblioteca quando ouviu um homem cantarolando e assoviando. John ficou muito incomodado.", "correctness": true}, {"question_id": 98, "substitution": "John estava fazendo uma pesquisa na biblioteca quando ouviu um homem cantarolando e assoviando. O homem ficou muito incomodado.", "correctness": false}, {"question_id": 99, "substitution": "John estava fazendo uma pesquisa na biblioteca quando ouviu um homem cantarolando e assoviando. O homem era muito irritante.", "correctness": true}, {"question_id": 99, "substitution": "John estava fazendo uma pesquisa na biblioteca quando ouviu um homem cantarolando e assoviando. John era muito irritante.", "correctness": false}, {"question_id": 100, "substitution": "John estava correndo pelo parque quando viu um homem fazendo malabarismos com melancias. John ficou muito impressionado.", "correctness": true}, {"question_id": 100, "substitution": "John estava correndo pelo parque quando viu um homem fazendo malabarismos com melancias. O malabarista ficou muito impressionado.", "correctness": false}, {"question_id": 101, "substitution": "John estava correndo pelo parque quando viu um homem fazendo malabarismos com melancias. O malabarista era muito impressionante.", "correctness": true}, {"question_id": 101, "substitution": "John estava correndo pelo parque quando viu um homem fazendo malabarismos com melancias. John era muito impressionante.", "correctness": false}, {"question_id": 102, "substitution": "Bob colapsou na calçada. Logo ele viu Carl vindo acudi-lo. Bob estava muito doente.", "correctness": true}, {"question_id": 102, "substitution": "Bob colapsou na calçada. Logo ele viu Carl vindo acudi-lo. Carl estava muito doente.", "correctness": false}, {"question_id": 103, "substitution": "Bob colapsou na calçada. Logo ele viu Carl vindo acudi-lo. Carl estava muito preocupado.", "correctness": true}, {"question_id": 103, "substitution": "Bob colapsou na calçada. Logo ele viu Carl vindo acudi-lo. Bob estava muito preocupado.", "correctness": false}, {"question_id": 104, "substitution": "Sam e Amy estão extremamente apaixonados, mas os pais da Amy estão incomodados com isso porque Sam e Amy têm quinze anos.", "correctness": true}, {"question_id": 104, "substitution": "Sam e Amy estão extremamente apaixonados, mas os pais da Amy estão incomodados com isso porque Os pais da Amy têm quinze anos.", "correctness": false}, {"question_id": 105, "substitution": "Sam e Amy estão extremamente apaixonados, mas os pais da Amy estão incomodados com isso porque Os pais da Amy são esnobes.", "correctness": true}, {"question_id": 105, "substitution": "Sam e Amy estão extremamente apaixonados, mas os pais da Amy estão incomodados com isso porque Sam and Amy são esnobes.", "correctness": false}, {"question_id": 106, "substitution": "Mark contou muitas mentiras sobre ele mesmo para o Pete, e Pete as incluiu no seu livro. Mark deveria ter sido mais sincero.", "correctness": true}, {"question_id": 106, "substitution": "Mark contou muitas mentiras sobre ele mesmo para o Pete, e Pete as incluiu no seu livro. Pete deveria ter sido mais sincero.", "correctness": false}, {"question_id": 107, "substitution": "Mark contou muitas mentiras sobre ele mesmo para o Pete, e Pete as incluiu no seu livro. Pete deveria ter sido mais cético.", "correctness": true}, {"question_id": 107, "substitution": "Mark contou muitas mentiras sobre ele mesmo para o Pete, e Pete as incluiu no seu livro. Mark deveria ter sido mais cético.", "correctness": false}, {"question_id": 108, "substitution": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará a velha casa na quinta-feira.", "correctness": true}, {"question_id": 108, "substitution": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará a nova casa na quinta-feira.", "correctness": false}, {"question_id": 109, "substitution": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará para a nova casa na quinta-feira.", "correctness": true}, {"question_id": 109, "substitution": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará para a velha casa na quinta-feira.", "correctness": false}, {"question_id": 110, "substitution": "Muitas pessoas começam a ler os livros do Paul e não conseguem largá-los. Pessoas ficam apegados porque Paul escreve muito bem.", "correctness": true}, {"question_id": 110, "substitution": "Muitas pessoas começam a ler os livros do Paul e não conseguem largá-los. Os livros do Paul ficam apegados porque Paul escreve muito bem.", "correctness": false}, {"question_id": 111, "substitution": "Muitas pessoas começam a ler os livros do Paul e não conseguem largá-los. Os livros do Paul são populares porque o Paul escreve muito bem.", "correctness": true}, {"question_id": 111, "substitution": "Muitas pessoas começam a ler os livros do Paul e não conseguem largá-los. Pessoas são populares porque o Paul escreve muito bem.", "correctness": false}, {"question_id": 112, "substitution": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela a flauta tem desde criança.", "correctness": true}, {"question_id": 112, "substitution": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela a peça tem desde criança.", "correctness": false}, {"question_id": 113, "substitution": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela a peça ama desde criança.", "correctness": true}, {"question_id": 113, "substitution": "Mary sacou sua flauta e tocou uma de suas peças favoritas. Ela a flauta ama desde criança.", "correctness": false}, {"question_id": 114, "substitution": "Sam puxou um banco para o piano, mas o banco estava quebrado, então ele teve que ficar em pé.", "correctness": true}, {"question_id": 114, "substitution": "Sam puxou um banco para o piano, mas o piano estava quebrado, então ele teve que ficar em pé.", "correctness": false}, {"question_id": 115, "substitution": "Sam puxou um banco para o piano, mas o piano estava quebrado, então ele teve que cantar.", "correctness": true}, {"question_id": 115, "substitution": "Sam puxou um banco para o piano, mas o banco estava quebrado, então ele teve que cantar.", "correctness": false}, {"question_id": 116, "substitution": "Como estava chovendo, eu carreguei a revista na minha mochila para mantê-a revista seca.", "correctness": true}, {"question_id": 116, "substitution": "Como estava chovendo, eu carreguei a revista na minha mochila para mantê-a mochila seca.", "correctness": false}, {"question_id": 117, "substitution": "Como estava chovendo, eu carreguei a revista sobre a minha mochila para mantê-a mochila seca.", "correctness": true}, {"question_id": 117, "substitution": "Como estava chovendo, eu carreguei a revista sobre a minha mochila para mantê-a revista seca.", "correctness": false}, {"question_id": 118, "substitution": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela o livro lê quando chega do trabalho.", "correctness": true}, {"question_id": 118, "substitution": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela o artigo lê quando chega do trabalho.", "correctness": false}, {"question_id": 119, "substitution": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela o artigo escreve quando chega do trabalho.", "correctness": true}, {"question_id": 119, "substitution": "Sara pegou um livro emprestado da biblioteca porque ela precisa dele para um artigo no qual ela está trabalhando. Ela o livro escreve quando chega do trabalho.", "correctness": false}, {"question_id": 120, "substitution": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde a maré o castelo de areia derrubou.", "correctness": true}, {"question_id": 120, "substitution": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde a maré o soldado derrubou.", "correctness": false}, {"question_id": 121, "substitution": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde o vento o soldado derrubou.", "correctness": true}, {"question_id": 121, "substitution": "Nesta manhã, Joey construiu um castelo de areia na praia, e colocou um soldado de brinquedo na torre mais alta, mas nesta tarde o vento o castelo de areia derrubou.", "correctness": false}, {"question_id": 122, "substitution": "Jane bateu à porta de Susan, mas ninguém respondeu. Jane ficou desapontada.", "correctness": true}, {"question_id": 122, "substitution": "Jane bateu à porta de Susan, mas ninguém respondeu. Susan ficou desapontada.", "correctness": false}, {"question_id": 123, "substitution": "Jane bateu à porta de Susan, mas ninguém respondeu. Susan tinha saído.", "correctness": true}, {"question_id": 123, "substitution": "Jane bateu à porta de Susan, mas ninguém respondeu. Jane tinha saído.", "correctness": false}, {"question_id": 124, "substitution": "Jane bateu à porta, e Susan atendeu. Jane convidou-a para sair.", "correctness": true}, {"question_id": 124, "substitution": "Jane bateu à porta, e Susan atendeu. Susan convidou-a para sair.", "correctness": false}, {"question_id": 125, "substitution": "Jane bateu à porta, e Susan atendeu. Susan convidou-a para entrar.", "correctness": true}, {"question_id": 125, "substitution": "Jane bateu à porta, e Susan atendeu. Jane convidou-a para entrar.", "correctness": false}, {"question_id": 126, "substitution": "Sam teve aulas de francês com o Adam, porque Sam estava ansioso para falar fluentemente.", "correctness": true}, {"question_id": 126, "substitution": "Sam teve aulas de francês com o Adam, porque Adam estava ansioso para falar fluentemente.", "correctness": false}, {"question_id": 127, "substitution": "Sam teve aulas de francês com o Adam, porque Adam era conhecido por falar fluentemente.", "correctness": true}, {"question_id": 127, "substitution": "Sam teve aulas de francês com o Adam, porque Sam era conhecido por falar fluentemente.", "correctness": false}, {"question_id": 128, "substitution": "O caminho até o lago estava interditado, então nós não podíamos usá-o caminho.", "correctness": true}, {"question_id": 128, "substitution": "O caminho até o lago estava interditado, então nós não podíamos usá-o lago.", "correctness": false}, {"question_id": 129, "substitution": "O caminho até o lago estava interditado, então nós não podíamos alcançá-o lago.", "correctness": true}, {"question_id": 129, "substitution": "O caminho até o lago estava interditado, então nós não podíamos alcançá-o caminho.", "correctness": false}, {"question_id": 130, "substitution": "A luz solar estava impedida por uma grande nuvem a manhã toda, por sorte, na hora em que o piquenique começou, a luz solar voltou.", "correctness": true}, {"question_id": 130, "substitution": "A luz solar estava impedida por uma grande nuvem a manhã toda, por sorte, na hora em que o piquenique começou, a nuvem voltou.", "correctness": false}, {"question_id": 131, "substitution": "A luz solar estava impedida por uma grande nuvem a manhã toda, por sorte, na hora em que o piquenique começou, a nuvem foi embora.", "correctness": true}, {"question_id": 131, "substitution": "A luz solar estava impedida por uma grande nuvem a manhã toda, por sorte, na hora em que o piquenique começou, a luz solar foi embora.", "correctness": false}, {"question_id": 132, "substitution": "Nós fomos para a lagoa, porque um tubarão havia sido avistado na praia, então a lagoa era um lugar mais seguro para nadar.", "correctness": true}, {"question_id": 132, "substitution": "Nós fomos para a lagoa, porque um tubarão havia sido avistado na praia, então a praia era um lugar mais seguro para nadar.", "correctness": false}, {"question_id": 133, "substitution": "Nós fomos para a lagoa, porque um tubarão havia sido avistado na praia, então a praia era um lugar perigoso para nadar.", "correctness": true}, {"question_id": 133, "substitution": "Nós fomos para a lagoa, porque um tubarão havia sido avistado na praia, então a lagoa era um lugar perigoso para nadar.", "correctness": false}, {"question_id": 134, "substitution": "Sam tentou pintar um quadro de pastoras com ovelhas, mas as pastoras acabaram ficando mais parecidas com golfistas.", "correctness": true}, {"question_id": 134, "substitution": "Sam tentou pintar um quadro de pastoras com ovelhas, mas as ovelhas acabaram ficando mais parecidas com golfistas.", "correctness": false}, {"question_id": 135, "substitution": "Sam tentou pintar um quadro de pastoras com ovelhas, mas as ovelhas acabaram ficando mais parecidas com cachorros.", "correctness": true}, {"question_id": 135, "substitution": "Sam tentou pintar um quadro de pastoras com ovelhas, mas as pastoras acabaram ficando mais parecidas com cachorros.", "correctness": false}, {"question_id": 136, "substitution": "Mary acomodou sua filha Anne na cama, para que Mary pudesse trabalhar.", "correctness": true}, {"question_id": 136, "substitution": "Mary acomodou sua filha Anne na cama, para que a filha da Mary pudesse trabalhar.", "correctness": false}, {"question_id": 137, "substitution": "Mary acomodou sua filha Anne na cama, para que a filha da Mary pudesse dormir.", "correctness": true}, {"question_id": 137, "substitution": "Mary acomodou sua filha Anne na cama, para que Mary pudesse dormir.", "correctness": false}, {"question_id": 138, "substitution": "Fred e Alice tinham casacos muito quentes, mas Fred e Alice não estavam preparados para o frio do Alasca.", "correctness": true}, {"question_id": 138, "substitution": "Fred e Alice tinham casacos muito quentes, mas casacos não estavam preparados para o frio do Alasca.", "correctness": false}, {"question_id": 139, "substitution": "Fred e Alice tinham casacos muito quentes, mas casacos não eram suficientes para o frio do Alasca.", "correctness": true}, {"question_id": 139, "substitution": "Fred e Alice tinham casacos muito quentes, mas Fred e Alice não eram suficientes para o frio do Alasca.", "correctness": false}, {"question_id": 140, "substitution": "Thomson visitou o túmulo de Cooper em 1765. Naquela data fazia cinco anos que Thomson estava viajando.", "correctness": true}, {"question_id": 140, "substitution": "Thomson visitou o túmulo de Cooper em 1765. Naquela data fazia cinco anos que Cooper estava viajando.", "correctness": false}, {"question_id": 141, "substitution": "Thomson visitou o túmulo de Cooper em 1765. Naquela data fazia cinco anos que Cooper estava morto.", "correctness": true}, {"question_id": 141, "substitution": "Thomson visitou o túmulo de Cooper em 1765. Naquela data fazia cinco anos que Thomson estava morto.", "correctness": false}, {"question_id": 142, "substitution": "Jackson sofreu forte influência de Arnold, mesmo Jackson tendo vivido dois séculos mais tarde.", "correctness": true}, {"question_id": 142, "substitution": "Jackson sofreu forte influência de Arnold, mesmo Arnold tendo vivido dois séculos mais tarde.", "correctness": false}, {"question_id": 143, "substitution": "Jackson sofreu forte influência de Arnold, mesmo Arnold tendo vivido dois séculos mais antes.", "correctness": true}, {"question_id": 143, "substitution": "Jackson sofreu forte influência de Arnold, mesmo Jackson tendo vivido dois séculos mais antes.", "correctness": false}, {"question_id": 144, "substitution": "Eu não consigo cortar aquela árvore com essa serra; a árvore é muito grossa.", "correctness": true}, {"question_id": 144, "substitution": "Eu não consigo cortar aquela árvore com essa serra; a serra é muito grossa.", "correctness": false}, {"question_id": 145, "substitution": "Eu não consigo cortar aquela árvore com essa serra; a serra é muito pequena.", "correctness": true}, {"question_id": 145, "substitution": "Eu não consigo cortar aquela árvore com essa serra; a árvore é muito pequena.", "correctness": false}, {"question_id": 146, "substitution": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que matá- las.", "correctness": true}, {"question_id": 146, "substitution": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que matá- las.", "correctness": false}, {"question_id": 147, "substitution": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que protegê- las.", "correctness": true}, {"question_id": 147, "substitution": "As raposas estão entrando à noite e atacando as galinhas. Eu terei que protegê- las.", "correctness": false}, {"question_id": 148, "substitution": "As raposas estão entrando à noite e atacando as galinhas. As raposas se tornaram muito ousadas.", "correctness": true}, {"question_id": 148, "substitution": "As raposas estão entrando à noite e atacando as galinhas. As galinhas se tornaram muito ousadas.", "correctness": false}, {"question_id": 149, "substitution": "As raposas estão entrando à noite e atacando as galinhas. As galinhas se tornaram muito nervosas.", "correctness": true}, {"question_id": 149, "substitution": "As raposas estão entrando à noite e atacando as galinhas. As raposas se tornaram muito nervosas.", "correctness": false}, {"question_id": 150, "substitution": "Fred cobriu seus olhos com as antebraços, porque o vento estava carregando muita areia. Ele seus olhos abriu quando o vento parou.", "correctness": true}, {"question_id": 150, "substitution": "Fred cobriu seus olhos com as antebraços, porque o vento estava carregando muita areia. Ele seus antebraços abriu quando o vento parou.", "correctness": false}, {"question_id": 151, "substitution": "Fred cobriu seus olhos com as antebraços, porque o vento estava carregando muita areia. Ele seus antebraços abaixou quando o vento parou.", "correctness": true}, {"question_id": 151, "substitution": "Fred cobriu seus olhos com as antebraços, porque o vento estava carregando muita areia. Ele seus olhos abaixou quando o vento parou.", "correctness": false}, {"question_id": 152, "substitution": "O nome da atriz costumava ser Terpsichore, mas ela o mudou para Tina há alguns, porque percebeu que Terpsichore era muito difícil de pronunciar.", "correctness": true}, {"question_id": 152, "substitution": "O nome da atriz costumava ser Terpsichore, mas ela o mudou para Tina há alguns, porque percebeu que Tina era muito difícil de pronunciar.", "correctness": false}, {"question_id": 153, "substitution": "O nome da atriz costumava ser Terpsichore, mas ela o mudou para Tina há alguns, porque percebeu que Tina era mais fácil de pronunciar.", "correctness": true}, {"question_id": 153, "substitution": "O nome da atriz costumava ser Terpsichore, mas ela o mudou para Tina há alguns, porque percebeu que Terpsichore era mais fácil de pronunciar.", "correctness": false}, {"question_id": 154, "substitution": "Fred assistiu TV enquanto George saiu para fazer as compras. Depois de uma hora Fred levantou.", "correctness": true}, {"question_id": 154, "substitution": "Fred assistiu TV enquanto George saiu para fazer as compras. Depois de uma hora George levantou.", "correctness": false}, {"question_id": 155, "substitution": "Fred assistiu TV enquanto George saiu para fazer as compras. Depois de uma hora George voltou.", "correctness": true}, {"question_id": 155, "substitution": "Fred assistiu TV enquanto George saiu para fazer as compras. Depois de uma hora Fred voltou.", "correctness": false}, {"question_id": 156, "substitution": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e a máquina de lavar ligou.", "correctness": true}, {"question_id": 156, "substitution": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e a tv ligou.", "correctness": false}, {"question_id": 157, "substitution": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e a tv desligou.", "correctness": true}, {"question_id": 157, "substitution": "Fred deveria ter ligado a máquina de lavar louça, mas ele adiou, porque queria assistir TV. Por fim o programa estava chato, então ele mudou de ideia e a máquina de lavar desligou.", "correctness": false}, {"question_id": 158, "substitution": "Fred é a única pessoa que ainda lembra do meu bisavô. Fred é um homem memorável.", "correctness": true}, {"question_id": 158, "substitution": "Fred é a única pessoa que ainda lembra do meu bisavô. Meu bisavô é um homem memorável.", "correctness": false}, {"question_id": 159, "substitution": "Fred é a única pessoa que ainda lembra do meu bisavô. Meu bisavô era um homem memorável.", "correctness": true}, {"question_id": 159, "substitution": "Fred é a única pessoa que ainda lembra do meu bisavô. Fred era um homem memorável.", "correctness": false}, {"question_id": 160, "substitution": "Fred é a única pessoa viva que lembra de meu pai enquanto criança. Quando Fred viu meu pai pela primeira vez, Fred tinha doze anos de idade.", "correctness": true}, {"question_id": 160, "substitution": "Fred é a única pessoa viva que lembra de meu pai enquanto criança. Quando Fred viu meu pai pela primeira vez, meu pai tinha doze anos de idade.", "correctness": false}, {"question_id": 161, "substitution": "Fred é a única pessoa viva que lembra de meu pai enquanto criança. Quando Fred viu meu pai pela primeira vez, meu pai tinha doze meses de idade.", "correctness": true}, {"question_id": 161, "substitution": "Fred é a única pessoa viva que lembra de meu pai enquanto criança. Quando Fred viu meu pai pela primeira vez, Fred tinha doze meses de idade.", "correctness": false}, {"question_id": 162, "substitution": "Em julho, Kamtchatka declarou guerra contra Yakutsk. Dado que o exército de Yakutsk era muito melhor equipado e dez vezes maior, Kamchatka foram derrotados em semanas.", "correctness": true}, {"question_id": 162, "substitution": "Em julho, Kamtchatka declarou guerra contra Yakutsk. Dado que o exército de Yakutsk era muito melhor equipado e dez vezes maior, Yakutsk foram derrotados em semanas.", "correctness": false}, {"question_id": 163, "substitution": "Em julho, Kamtchatka declarou guerra contra Yakutsk. Dado que o exército de Yakutsk era muito melhor equipado e dez vezes maior, Yakutsk foram vitoriosos em semanas.", "correctness": true}, {"question_id": 163, "substitution": "Em julho, Kamtchatka declarou guerra contra Yakutsk. Dado que o exército de Yakutsk era muito melhor equipado e dez vezes maior, Kamchatka foram vitoriosos em semanas.", "correctness": false}, {"question_id": 164, "substitution": "Olhe! Há um peixinho nadando bem debaixo daquele pato! É melhor o peixinho fugir para um lugar seguro rápido!", "correctness": true}, {"question_id": 164, "substitution": "Olhe! Há um peixinho nadando bem debaixo daquele pato! É melhor o pato fugir para um lugar seguro rápido!", "correctness": false}, {"question_id": 165, "substitution": "Olhe! Há um tubarão nadando bem debaixo daquele pato! É melhor o pato fugir para um lugar seguro rápido!", "correctness": true}, {"question_id": 165, "substitution": "Olhe! Há um tubarão nadando bem debaixo daquele pato! É melhor o tubarão fugir para um lugar seguro rápido!", "correctness": false}, {"question_id": 166, "substitution": "Arqueologistas concluíram que humanos viveram em Laputa 20.000 anos atrás. Arqueologistas buscaram por evidências às margens do rio.", "correctness": true}, {"question_id": 166, "substitution": "Arqueologistas concluíram que humanos viveram em Laputa 20.000 anos atrás. Humanos pré-históricos buscaram por evidências às margens do rio.", "correctness": false}, {"question_id": 167, "substitution": "Arqueologistas concluíram que humanos viveram em Laputa 20.000 anos atrás. Humanos pré-históricos caçavam veados às margens do rio.", "correctness": true}, {"question_id": 167, "substitution": "Arqueologistas concluíram que humanos viveram em Laputa 20.000 anos atrás. Arqueologistas caçavam veados às margens do rio.", "correctness": false}, {"question_id": 168, "substitution": "As universidades estão estudando três espécies de peixe que recentemente foram encontradas vivendo no Oceano Índico. As universidades começaram dois anos atrás.", "correctness": true}, {"question_id": 168, "substitution": "As universidades estão estudando três espécies de peixe que recentemente foram encontradas vivendo no Oceano Índico. As espécies de peixe começaram dois anos atrás.", "correctness": false}, {"question_id": 169, "substitution": "As universidades estão estudando três espécies de peixe que recentemente foram encontradas vivendo no Oceano Índico. As espécies de peixe apareceram dois anos atrás.", "correctness": true}, {"question_id": 169, "substitution": "As universidades estão estudando três espécies de peixe que recentemente foram encontradas vivendo no Oceano Índico. As universidades apareceram dois anos atrás.", "correctness": false}, {"question_id": 170, "substitution": "Os jornalistas entrevistaram os astros do novo filme. Os astros foram muito cooperativos, então a entrevista se estendeu por muito tempo.", "correctness": true}, {"question_id": 170, "substitution": "Os jornalistas entrevistaram os astros do novo filme. Os jornalistas foram muito cooperativos, então a entrevista se estendeu por muito tempo.", "correctness": false}, {"question_id": 171, "substitution": "A polícia prendeu todos os membros da gangue. Eles estavam tentando acabar com o tráfico de drogas na vizinhança.", "correctness": true}, {"question_id": 171, "substitution": "A polícia prendeu todos os membros da gangue. Eles estavam tentando acabar com o tráfico de drogas na vizinhança.", "correctness": false}, {"question_id": 172, "substitution": "A polícia prendeu todos os membros da gangue. Eles estavam tentando fazer tráfico de drogas na vizinhança.", "correctness": true}, {"question_id": 172, "substitution": "A polícia prendeu todos os membros da gangue. Eles estavam tentando fazer tráfico de drogas na vizinhança.", "correctness": false}, {"question_id": 173, "substitution": "Eu pus a torta na geladeira. A torta tem muita manteiga nela.", "correctness": true}, {"question_id": 173, "substitution": "Eu pus a torta na geladeira. A geladeira tem muita manteiga nela.", "correctness": false}, {"question_id": 174, "substitution": "Eu pus a torta na geladeira. A geladeira tem muitas sobras de comida nela.", "correctness": true}, {"question_id": 174, "substitution": "Eu pus a torta na geladeira. A torta tem muitas sobras de comida nela.", "correctness": false}, {"question_id": 175, "substitution": "Sam quebrou ambas as pernas e agora ele está andando com muletas. Mas em aproximadamente um mês as pernas devem estar melhores.", "correctness": true}, {"question_id": 175, "substitution": "Sam quebrou ambas as pernas e agora ele está andando com muletas. Mas em aproximadamente um mês as muletas devem estar melhores.", "correctness": false}, {"question_id": 176, "substitution": "Sam quebrou ambas as pernas e agora ele está andando com muletas. Mas em aproximadamente um mês as muletas devem não ser mais necessárias.", "correctness": true}, {"question_id": 176, "substitution": "Sam quebrou ambas as pernas e agora ele está andando com muletas. Mas em aproximadamente um mês as pernas devem não ser mais necessárias.", "correctness": false}, {"question_id": 177, "substitution": "Quando os apoiadores do projeto de lei chegaram à prefeitura, foram surpreendidos ao encontrarem a sala repleta de opositores. Os apoiadores estavam em vasta minoria.", "correctness": true}, {"question_id": 177, "substitution": "Quando os apoiadores do projeto de lei chegaram à prefeitura, foram surpreendidos ao encontrarem a sala repleta de opositores. Os opositores estavam em vasta minoria.", "correctness": false}, {"question_id": 178, "substitution": "Quando os apoiadores do projeto de lei chegaram à prefeitura, foram surpreendidos ao encontrarem a sala repleta de opositores. Os opositores estavam em vasta maioria.", "correctness": true}, {"question_id": 178, "substitution": "Quando os apoiadores do projeto de lei chegaram à prefeitura, foram surpreendidos ao encontrarem a sala repleta de opositores. Os apoiadores estavam em vasta maioria.", "correctness": false}, {"question_id": 179, "substitution": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer mais os biscoitos de aveia.", "correctness": true}, {"question_id": 179, "substitution": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer mais os biscoitos com gotas de chocolate.", "correctness": false}, {"question_id": 180, "substitution": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer menos os biscoitos com gotas de chocolate.", "correctness": true}, {"question_id": 180, "substitution": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer menos os biscoitos de aveia.", "correctness": false}, {"question_id": 181, "substitution": "A gente havia planejado colocar cópias da nossa newsletter o sobre todas as cadeiras no auditório, mas não havia o suficiente cópias da newsletter.", "correctness": true}, {"question_id": 181, "substitution": "A gente havia planejado colocar cópias da nossa newsletter o sobre todas as cadeiras no auditório, mas não havia o suficiente cadeiras.", "correctness": false}, {"question_id": 182, "substitution": "A gente havia planejado colocar cópias da nossa newsletter sobre todas as cadeiras no auditório, mas havia muitas cadeiras.", "correctness": true}, {"question_id": 182, "substitution": "A gente havia planejado colocar cópias da nossa newsletter sobre todas as cadeiras no auditório, mas havia muitas cópias da newsletter.", "correctness": false}, {"question_id": 183, "substitution": "Eu enfiei uma agulha através de uma cenoura. Quando eu removi a agulha, a agulha deixou um buraco.", "correctness": true}, {"question_id": 183, "substitution": "Eu enfiei uma agulha através de uma cenoura. Quando eu removi a agulha, a cenoura deixou um buraco.", "correctness": false}, {"question_id": 184, "substitution": "Eu enfiei uma agulha através de uma cenoura. Quando eu removi a agulha, a cenoura tinha um buraco.", "correctness": true}, {"question_id": 184, "substitution": "Eu enfiei uma agulha através de uma cenoura. Quando eu removi a agulha, a agulha tinha um buraco.", "correctness": false}, {"question_id": 185, "substitution": "Eu não estava encontrando uma colher, então eu tentei usar um pincel para mexer meu café. Mas por fim isso foi uma má ideia, porque o pincel ficou cheio de café.", "correctness": true}, {"question_id": 185, "substitution": "Eu não estava encontrando uma colher, então eu tentei usar um pincel para mexer meu café. Mas por fim isso foi uma má ideia, porque o café ficou cheio de café.", "correctness": false}, {"question_id": 186, "substitution": "Eu não estava encontrando uma colher, então eu tentei usar um pincel para mexer meu café. Mas por fim isso foi uma má ideia, porque o café ficou cheio de tinta.", "correctness": true}, {"question_id": 186, "substitution": "Eu não estava encontrando uma colher, então eu tentei usar um pincel para mexer meu café. Mas por fim isso foi uma má ideia, porque o pincel ficou cheio de tinta.", "correctness": false}, {"question_id": 187, "substitution": "Steve segue o examplo do Fred em tudo. Steve o admira imensamente.", "correctness": true}, {"question_id": 187, "substitution": "Steve segue o examplo do Fred em tudo. Fred o admira imensamente.", "correctness": false}, {"question_id": 188, "substitution": "Steve segue o examplo do Fred em tudo. Fred o influencia imensamente.", "correctness": true}, {"question_id": 188, "substitution": "Steve segue o examplo do Fred em tudo. Steve o influencia imensamente.", "correctness": false}, {"question_id": 189, "substitution": "A mesa não vai passar pela porta de entrada porque a mesa é muito larga.", "correctness": true}, {"question_id": 189, "substitution": "A mesa não vai passar pela porta de entrada porque a porta de entrada é muito larga.", "correctness": false}, {"question_id": 190, "substitution": "A mesa não vai passar pela porta de entrada porque a porta de entrada é muito estreita.", "correctness": true}, {"question_id": 190, "substitution": "A mesa não vai passar pela porta de entrada porque a mesa é muito estreita.", "correctness": false}, {"question_id": 191, "substitution": "Grace estava muito feliz em trocar sua blusa por minha jaqueta. Ela acha que a blusa fica deselegante nela.", "correctness": true}, {"question_id": 191, "substitution": "Grace estava muito feliz em trocar sua blusa por minha jaqueta. Ela acha que a jaqueta fica deselegante nela.", "correctness": false}, {"question_id": 192, "substitution": "Grace estava muito feliz em trocar sua blusa por minha jaqueta. Ela acha que a jaqueta fica muito bem nela.", "correctness": true}, {"question_id": 192, "substitution": "Grace estava muito feliz em trocar sua blusa por minha jaqueta. Ela acha que a blusa fica muito bem nela.", "correctness": false}, {"question_id": 193, "substitution": "John contratou Bill para cuidar John.", "correctness": true}, {"question_id": 193, "substitution": "John contratou Bill para cuidar Bill.", "correctness": false}, {"question_id": 194, "substitution": "John foi contratado por Bill para cuidar Bill.", "correctness": true}, {"question_id": 194, "substitution": "John foi contratado por Bill para cuidar John.", "correctness": false}, {"question_id": 195, "substitution": "John prometeu a Bill que iria embora, então uma hora mais tarde John partiu.", "correctness": true}, {"question_id": 195, "substitution": "John prometeu a Bill que iria embora, então uma hora mais tarde Bill partiu.", "correctness": false}, {"question_id": 196, "substitution": "John ordenou a Bill que fosse embora, então uma hora mais tarde Bill partiu.", "correctness": true}, {"question_id": 196, "substitution": "John ordenou a Bill que fosse embora, então uma hora mais tarde John partiu.", "correctness": false}, {"question_id": 197, "substitution": "A biografia de Sam Goodman sobre o general espartano Xenophanes comunica vividamente as dificuldades que Goodman enfrentou em sua pesquisa.", "correctness": true}, {"question_id": 197, "substitution": "A biografia de Sam Goodman sobre o general espartano Xenophanes comunica vividamente as dificuldades que Xenophanes enfrentou em sua pesquisa.", "correctness": false}, {"question_id": 198, "substitution": "A biografia de Sam Goodman sobre o general espartano Xenophanes comunica vividamente as dificuldades que Xenophanes enfrentou em sua infância.", "correctness": true}, {"question_id": 198, "substitution": "A biografia de Sam Goodman sobre o general espartano Xenophanes comunica vividamente as dificuldades que Goodman enfrentou em sua infância.", "correctness": false}, {"question_id": 199, "substitution": "A mãe da Emma havia morrido faz muitos anos, e a educação Emma estava sendo cuidada por uma excelente governanta.", "correctness": true}, {"question_id": 199, "substitution": "A mãe da Emma havia morrido faz muitos anos, e a educação A mãe da Emma estava sendo cuidada por uma excelente governanta.", "correctness": false}, {"question_id": 200, "substitution": "A mãe da Emma havia morrido faz muitos anos, e a casa A mãe da Emma estava sendo cuidada por uma excelente governanta.", "correctness": true}, {"question_id": 200, "substitution": "A mãe da Emma havia morrido faz muitos anos, e a casa Emma estava sendo cuidada por uma excelente governanta.", "correctness": false}, {"question_id": 201, "substitution": "Jane bateu à porta de Susan mas Jane não foi atendida.", "correctness": true}, {"question_id": 201, "substitution": "Jane bateu à porta de Susan mas Susan não foi atendida.", "correctness": false}, {"question_id": 202, "substitution": "Jane bateu à porta de Susan mas Susan não atendeu.", "correctness": true}, {"question_id": 202, "substitution": "Jane bateu à porta de Susan mas Jane não atendeu.", "correctness": false}, {"question_id": 203, "substitution": "Joe pagou o detetive após joe ter recebido o relatório final sobre o caso.", "correctness": true}, {"question_id": 203, "substitution": "Joe pagou o detetive após o detetive ter recebido o relatório final sobre o caso.", "correctness": false}, {"question_id": 204, "substitution": "Joe pagou o detetive após o detetive ter entregado o relatório final sobre o caso.", "correctness": true}, {"question_id": 204, "substitution": "Joe pagou o detetive após joe ter entregado o relatório final sobre o caso.", "correctness": false}, {"question_id": 205, "substitution": "Beth não ficou brava com Sally, que havia a deixado de fora, porque Beth parou e contou até dez.", "correctness": true}, {"question_id": 205, "substitution": "Beth não ficou brava com Sally, que havia a deixado de fora, porque Sally parou e contou até dez.", "correctness": false}, {"question_id": 206, "substitution": "Beth não ficou brava com Sally, que havia a deixado de fora, porque Sally parou e pediu desculpas.", "correctness": true}, {"question_id": 206, "substitution": "Beth não ficou brava com Sally, que havia a deixado de fora, porque Beth parou e pediu desculpas.", "correctness": false}, {"question_id": 207, "substitution": "Jim fez um sinal para o barman e apontou para Jim taça vazia.", "correctness": true}, {"question_id": 207, "substitution": "Jim fez um sinal para o barman e apontou para o barman taça vazia.", "correctness": false}, {"question_id": 208, "substitution": "Jim fez um sinal para o barman e apontou para o barman chave do banheiro.", "correctness": true}, {"question_id": 208, "substitution": "Jim fez um sinal para o barman e apontou para Jim chave do banheiro.", "correctness": false}, {"question_id": 209, "substitution": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque Dan \"Eu primeiro!\" era lento.", "correctness": true}, {"question_id": 209, "substitution": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque Bill \"Eu primeiro!\" era lento.", "correctness": false}, {"question_id": 210, "substitution": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque Bill \"Eu primeiro!\" era mais rápido.", "correctness": true}, {"question_id": 210, "substitution": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque Dan \"Eu primeiro!\" era mais rápido.", "correctness": false}, {"question_id": 211, "substitution": "Tom disse \"Check\" para Ralph enquanto ele movia Tom bispo.", "correctness": true}, {"question_id": 211, "substitution": "Tom disse \"Check\" para Ralph enquanto ele movia Ralph bispo.", "correctness": false}, {"question_id": 212, "substitution": "Tom disse \"Check\" para Ralph enquanto ele tomava Ralph bispo.", "correctness": true}, {"question_id": 212, "substitution": "Tom disse \"Check\" para Ralph enquanto ele tomava Tom bispo.", "correctness": false}, {"question_id": 213, "substitution": "Enquanto Andrea no pequeno avião passava sobre Susan, Andrea podia ver a pista de aterrissagem.", "correctness": true}, {"question_id": 213, "substitution": "Enquanto Andrea no pequeno avião passava sobre Susan, Susan podia ver a pista de aterrissagem.", "correctness": false}, {"question_id": 214, "substitution": "Enquanto Andrea no pequeno avião passava sobre Susan, Susan podia ver o trem de pouso.", "correctness": true}, {"question_id": 214, "substitution": "Enquanto Andrea no pequeno avião passava sobre Susan, Andrea podia ver o trem de pouso.", "correctness": false}, {"question_id": 215, "substitution": "Tom deu uma carona até a escola para Ralph para Tom não ter que dirigir sozinho.", "correctness": true}, {"question_id": 215, "substitution": "Tom deu uma carona até a escola para Ralph para Ralph não ter que dirigir sozinho.", "correctness": false}, {"question_id": 216, "substitution": "Tom deu uma carona até a escola para Ralph para Ralph não ter que caminhar.", "correctness": true}, {"question_id": 216, "substitution": "Tom deu uma carona até a escola para Ralph para Tom não ter que caminhar.", "correctness": false}, {"question_id": 217, "substitution": "Bill passou o prato pela metade para John porque Bill estava satisfeito.", "correctness": true}, {"question_id": 217, "substitution": "Bill passou o prato pela metade para John porque John estava satisfeito.", "correctness": false}, {"question_id": 218, "substitution": "Bill passou o prato pela metade para John porque John estava com fome.", "correctness": true}, {"question_id": 218, "substitution": "Bill passou o prato pela metade para John porque Bill estava com fome.", "correctness": false}, {"question_id": 219, "substitution": "Bill passou o gameboy para John porque Bill vez tinha acabado.", "correctness": true}, {"question_id": 219, "substitution": "Bill passou o gameboy para John porque John vez tinha acabado.", "correctness": false}, {"question_id": 220, "substitution": "Bill passou o gameboy para John porque John vez era a próxima.", "correctness": true}, {"question_id": 220, "substitution": "Bill passou o gameboy para John porque Bill vez era a próxima.", "correctness": false}, {"question_id": 221, "substitution": "O homem levantou o menino sobre o homem cabeça.", "correctness": true}, {"question_id": 221, "substitution": "O homem levantou o menino sobre o menino cabeça.", "correctness": false}, {"question_id": 222, "substitution": "O homem levantou o menino até o menino beliche.", "correctness": true}, {"question_id": 222, "substitution": "O homem levantou o menino até o homem beliche.", "correctness": false}, {"question_id": 223, "substitution": "Alongando a mulher costas, a mulher sorriu para a menina.", "correctness": true}, {"question_id": 223, "substitution": "Alongando a menina costas, a mulher sorriu para a menina.", "correctness": false}, {"question_id": 224, "substitution": "Dando um tapinha em a menina costas, a mulher sorriu para a menina.", "correctness": true}, {"question_id": 224, "substitution": "Dando um tapinha em a mulher costas, a mulher sorriu para a menina.", "correctness": false}, {"question_id": 225, "substitution": "Billy chorou porque Toby não queria aceitar Billy brinquedo.", "correctness": true}, {"question_id": 225, "substitution": "Billy chorou porque Toby não queria aceitar Toby brinquedo.", "correctness": false}, {"question_id": 226, "substitution": "Billy chorou porque Toby não queria compartilhar Toby brinquedo.", "correctness": true}, {"question_id": 226, "substitution": "Billy chorou porque Toby não queria compartilhar Billy brinquedo.", "correctness": false}, {"question_id": 227, "substitution": "Lily conversou com Donna, quebrando Lily promessa.", "correctness": true}, {"question_id": 227, "substitution": "Lily conversou com Donna, quebrando Donna promessa.", "correctness": false}, {"question_id": 228, "substitution": "Lily conversou com Donna, tirando Donna concentração.", "correctness": true}, {"question_id": 228, "substitution": "Lily conversou com Donna, tirando Lily concentração.", "correctness": false}, {"question_id": 229, "substitution": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhouTommy com olhar empático.", "correctness": true}, {"question_id": 229, "substitution": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhouTimmy com olhar empático.", "correctness": false}, {"question_id": 230, "substitution": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhouTimmy com olhar severo.", "correctness": true}, {"question_id": 230, "substitution": "Quando Tommy derrubou seu sorvete, Timmy gargalhou, então seu pai olhouTommy com olhar severo.", "correctness": false}, {"question_id": 231, "substitution": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, Ollie pernas doíam.", "correctness": true}, {"question_id": 231, "substitution": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, Tommy pernas doíam.", "correctness": false}, {"question_id": 232, "substitution": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, Tommy pernas balançavam.", "correctness": true}, {"question_id": 232, "substitution": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, Ollie pernas balançavam.", "correctness": false}, {"question_id": 233, "substitution": "O pai carregava o menino dormindo em o pai colo.", "correctness": true}, {"question_id": 233, "substitution": "O pai carregava o menino dormindo em o menino colo.", "correctness": false}, {"question_id": 234, "substitution": "O pai carregava o menino dormindo em o menino berço.", "correctness": true}, {"question_id": 234, "substitution": "O pai carregava o menino dormindo em o pai berço.", "correctness": false}, {"question_id": 235, "substitution": "A mulher estava segurando a menina contra a mulher peito.", "correctness": true}, {"question_id": 235, "substitution": "A mulher estava segurando a menina contra a menina peito.", "correctness": false}, {"question_id": 236, "substitution": "A mulher estava segurando a menina contra seudesejo.", "correctness": true}, {"question_id": 236, "substitution": "A mulher estava segurando a menina contra seudesejo.", "correctness": false}, {"question_id": 237, "substitution": "Os pais da Pam chegaram em casa e a encontraram transando com seu namorado, Paul. Os pais da Pam ficaram furiosos com isso.", "correctness": true}, {"question_id": 237, "substitution": "Os pais da Pam chegaram em casa e a encontraram transando com seu namorado, Paul. Pam and Paul ficaram furiosos com isso.", "correctness": false}, {"question_id": 238, "substitution": "Os pais da Pam chegaram em casa e a encontraram transando com seu namorado, Paul. Pam and Paul ficaram constrangidos com isso.", "correctness": true}, {"question_id": 238, "substitution": "Os pais da Pam chegaram em casa e a encontraram transando com seu namorado, Paul. Os pais da Pam ficaram constrangidos com isso.", "correctness": false}, {"question_id": 239, "substitution": "Dra. Adams informou a Kate que A Dra. Adams tinha se aposentado e apresentou diversas opções para continuidade no seu tratamento.", "correctness": true}, {"question_id": 239, "substitution": "Dra. Adams informou a Kate que A Kate tinha se aposentado e apresentou diversas opções para continuidade no seu tratamento.", "correctness": false}, {"question_id": 240, "substitution": "Dra. Adams informou a Kate que A Kate tinha câncer e apresentou diversas opções para continuidade no seu tratamento.", "correctness": true}, {"question_id": 240, "substitution": "Dra. Adams informou a Kate que A Dra. Adams tinha câncer e apresentou diversas opções para continuidade no seu tratamento.", "correctness": false}, {"question_id": 241, "substitution": "Dan tinha que fazer Bill parar de brincar com o pássaro machucado. Dan é muito compassivo.", "correctness": true}, {"question_id": 241, "substitution": "Dan tinha que fazer Bill parar de brincar com o pássaro machucado. Bill é muito compassivo.", "correctness": false}, {"question_id": 242, "substitution": "Dan tinha que fazer Bill parar de brincar com o pássaro machucado. Bill é muito cruel.", "correctness": true}, {"question_id": 242, "substitution": "Dan tinha que fazer Bill parar de brincar com o pássaro machucado. Dan é muito cruel.", "correctness": false}, {"question_id": 243, "substitution": "George conseguiu ingressos de graça para a peça, mas ele os deu para Eric, mesmo George estando particularmente interessado em assisti-la.", "correctness": true}, {"question_id": 243, "substitution": "George conseguiu ingressos de graça para a peça, mas ele os deu para Eric, mesmo Eric estando particularmente interessado em assisti-la.", "correctness": false}, {"question_id": 244, "substitution": "George conseguiu ingressos de graça para a peça, mas ele os deu para Eric, porque Eric estava particularmente interessado em assisti-la.", "correctness": true}, {"question_id": 244, "substitution": "George conseguiu ingressos de graça para a peça, mas ele os deu para Eric, porque George estava particularmente interessado em assisti-la.", "correctness": false}, {"question_id": 245, "substitution": "George conseguiu ingressos de graça para a peça, mas ele os deu para Eric, porque George não estava particularmente interessado em assisti-la.", "correctness": true}, {"question_id": 245, "substitution": "George conseguiu ingressos de graça para a peça, mas ele os deu para Eric, porque Eric não estava particularmente interessado em assisti-la.", "correctness": false}, {"question_id": 246, "substitution": "Jane deu doces para Joan porque Jane não estava com fome.", "correctness": true}, {"question_id": 246, "substitution": "Jane deu doces para Joan porque Joan não estava com fome.", "correctness": false}, {"question_id": 247, "substitution": "Jane deu doces para Joan porque Joan estava com fome.", "correctness": true}, {"question_id": 247, "substitution": "Jane deu doces para Joan porque Jane estava com fome.", "correctness": false}, {"question_id": 248, "substitution": "Eu tentei fazer uma pintura de um pomar, com limões nos limoeiros, mas os limões acabaram parecendo mais lâmpadas.", "correctness": true}, {"question_id": 248, "substitution": "Eu tentei fazer uma pintura de um pomar, com limões nos limoeiros, mas os limoeiros acabaram parecendo mais lâmpadas.", "correctness": false}, {"question_id": 249, "substitution": "Eu tentei fazer uma pintura de um pomar, com limões nos limoeiros, mas os limoeiros acabaram parecendo mais telefones públicos.", "correctness": true}, {"question_id": 249, "substitution": "Eu tentei fazer uma pintura de um pomar, com limões nos limoeiros, mas os limões acabaram parecendo mais telefones públicos.", "correctness": false}, {"question_id": 250, "substitution": "James pediu um favor ao Robert mas O favor foi recusado.", "correctness": true}, {"question_id": 250, "substitution": "James pediu um favor ao Robert mas Robert foi recusado.", "correctness": false}, {"question_id": 251, "substitution": "James pediu um favor ao Robert mas Robert recusou-se.", "correctness": true}, {"question_id": 251, "substitution": "James pediu um favor ao Robert mas O favor recusou-se.", "correctness": false}, {"question_id": 252, "substitution": "Kirilov cedeu a presidência a Shatov porque Kirilov era menos popular.", "correctness": true}, {"question_id": 252, "substitution": "Kirilov cedeu a presidência a Shatov porque Shatov era menos popular.", "correctness": false}, {"question_id": 253, "substitution": "Kirilov cedeu a presidência a Shatov porque Shatov era mais popular.", "correctness": true}, {"question_id": 253, "substitution": "Kirilov cedeu a presidência a Shatov porque Kirilov era mais popular.", "correctness": false}, {"question_id": 254, "substitution": "Emma não passou a bola para Janie apesar de Emma ter visto que ela estava livre.", "correctness": true}, {"question_id": 254, "substitution": "Emma não passou a bola para Janie apesar de Janie ter visto que ela estava livre.", "correctness": false}, {"question_id": 255, "substitution": "Emma não passou a bola para Janie apesar de ela estar livre .", "correctness": true}, {"question_id": 255, "substitution": "Emma não passou a bola para Janie apesar de ela estar livre .", "correctness": false}, {"question_id": 256, "substitution": "Eu pus a asa de borboleta sobre a mesa e a asa de borboleta se quebrou.", "correctness": true}, {"question_id": 256, "substitution": "Eu pus a asa de borboleta sobre a mesa e a mesa se quebrou.", "correctness": false}, {"question_id": 257, "substitution": "Eu pus um livro pesado sobre a mesa e the table se quebrou.", "correctness": true}, {"question_id": 257, "substitution": "Eu pus um livro pesado sobre a mesa e the heavy book se quebrou.", "correctness": false}, {"question_id": 258, "substitution": "Madonna demitiu sua treinadora porque madonna não suportava o namorado dela.", "correctness": true}, {"question_id": 258, "substitution": "Madonna demitiu sua treinadora porque a treinadora não suportava o namorado dela.", "correctness": false}, {"question_id": 259, "substitution": "Madonna demitiu sua treinadora porque a treinadora dormiu com o namorado dela.", "correctness": true}, {"question_id": 259, "substitution": "Madonna demitiu sua treinadora porque madonna dormiu com o namorado dela.", "correctness": false}, {"question_id": 260, "substitution": "Madonna demitiu sua treinadora porque ela dormiu com o namorado dela .", "correctness": true}, {"question_id": 260, "substitution": "Madonna demitiu sua treinadora porque ela dormiu com o namorado dela .", "correctness": false}, {"question_id": 261, "substitution": "Madonna demitiu sua treinadora porque ela não suportava o namorado dela .", "correctness": true}, {"question_id": 261, "substitution": "Madonna demitiu sua treinadora porque ela não suportava o namorado dela .", "correctness": false}, {"question_id": 262, "substitution": "Carol acreditava que Rebecca suspeitava que ela tinha roubado o relógio.", "correctness": true}, {"question_id": 262, "substitution": "Carol acreditava que Rebecca suspeitava que ela tinha roubado o relógio.", "correctness": false}, {"question_id": 263, "substitution": "Carol acreditava que Rebecca lamentava que ela tinha roubado o relógio.", "correctness": true}, {"question_id": 263, "substitution": "Carol acreditava que Rebecca lamentava que ela tinha roubado o relógio.", "correctness": false}, {"question_id": 264, "substitution": "Este livro introduziu Shakespeare a Ovídio; ele foi uma grande influência em michael escrita.", "correctness": true}, {"question_id": 264, "substitution": "Este livro introduziu Shakespeare a Ovídio; ele foi uma grande influência em resposta correta: a. fonte original: ernest davis (vindo de uma discussão de facebook com escrita.", "correctness": false}, {"question_id": 265, "substitution": "Este livro introduziu Shakespeare a Goethe; ele foi uma grande influência em michael escrita.", "correctness": true}, {"question_id": 265, "substitution": "Este livro introduziu Shakespeare a Goethe; ele foi uma grande influência em resposta correta: b. fonte original: ernest davis (vindo de uma discussão de facebook com escrita.", "correctness": false}, {"question_id": 266, "substitution": "Este livro introduziu Shakespeare a Ovídio; ele era uma excelente seleção de michael escrita.", "correctness": true}, {"question_id": 266, "substitution": "Este livro introduziu Shakespeare a Ovídio; ele era uma excelente seleção de resposta correta: b. fonte original: ernest davis (vindo de uma discussão de facebook com escrita.", "correctness": false}, {"question_id": 267, "substitution": "Este livro introduziu Shakespeare a Goethe; ele era uma excelente seleção de michael escrita.", "correctness": true}, {"question_id": 267, "substitution": "Este livro introduziu Shakespeare a Goethe; ele era uma excelente seleção de resposta correta: a. fonte original: ernest davis (vindo de uma discussão de facebook com escrita.", "correctness": false}, {"question_id": 268, "substitution": "Alice procurou por sua amiga Jade na multidão. Dado que ela sempre tem muita sorte, Alice a encontrou rapidamente.", "correctness": true}, {"question_id": 268, "substitution": "Alice procurou por sua amiga Jade na multidão. Dado que ela sempre tem muita sorte, Alice a encontrou rapidamente.", "correctness": false}, {"question_id": 269, "substitution": "Alice procurou por sua amiga Jade na multidão. Dado que Jade sempre usa um turbante vermelho, Alice a encontrou rapidamente.", "correctness": true}, {"question_id": 269, "substitution": "Alice procurou por sua amiga Jade na multidão. Dado que Alice sempre usa um turbante vermelho, Alice a encontrou rapidamente.", "correctness": false}, {"question_id": 270, "substitution": "Durante um jogo de pega-pega, Ethan perseguiu Luke porque \"estava com Ethan \".", "correctness": true}, {"question_id": 270, "substitution": "Durante um jogo de pega-pega, Ethan perseguiu Luke porque \"estava com Luke \".", "correctness": false}, {"question_id": 271, "substitution": "Durante um jogo de pega-pega, Ethan fugiu do Luke porque \"estava com Luke \".", "correctness": true}, {"question_id": 271, "substitution": "Durante um jogo de pega-pega, Ethan fugiu do Luke porque \"estava com Ethan \".", "correctness": false}, {"question_id": 272, "substitution": "Na competição Loebner os juízes não conseguiam descobrir quais respondentes eram os chatbots porque os juízes eram muito estúpidos.", "correctness": true}, {"question_id": 272, "substitution": "Na competição Loebner os juízes não conseguiam descobrir quais respondentes eram os chatbots porque os chatbots eram muito estúpidos.", "correctness": false}, {"question_id": 273, "substitution": "Na competição Loebner os juízes não conseguiam descobrir quais respondentes eram os chatbots porque os chatbots eram muito avançados.", "correctness": true}, {"question_id": 273, "substitution": "Na competição Loebner os juízes não conseguiam descobrir quais respondentes eram os chatbots porque os juízes eram muito avançados.", "correctness": false}, {"question_id": 274, "substitution": "O usuário mudou sua senha \"GrWQWu8JyC\" para \"willow-towered Canopy Huntertropic wrestles\" porque willow-towered Canopy era fácil de esquecer.", "correctness": true}, {"question_id": 274, "substitution": "O usuário mudou sua senha \"GrWQWu8JyC\" para \"willow-towered Canopy Huntertropic wrestles\" porque Huntertropic wrestles era fácil de esquecer.", "correctness": false}, {"question_id": 275, "substitution": "O usuário mudou sua senha \"GrWQWu8JyC\" para \"willow-towered Canopy Huntertropic wrestles\" porque Huntertropic wrestles era fácil de lembrar.", "correctness": true}, {"question_id": 275, "substitution": "O usuário mudou sua senha \"GrWQWu8JyC\" para \"willow-towered Canopy Huntertropic wrestles\" porque willow-towered Canopy era fácil de lembrar.", "correctness": false}]