[
  {
    "question_id": 40,
    "manually_fixed_correct_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós punimos os alunos mais velhos.",
    "manually_fixed_incorrect_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós punimos os alunos mais jovens.",
    "manually_fixed_correct_switched": "Os alunos mais jovens estavam fazendo bullying com os mais velhos, então nós punimos os alunos mais jovens.",
    "manually_fixed_incorrect_switched": "Os alunos mais jovens estavam fazendo bullying com os mais velhos, então nós punimos os alunos mais velhos."
  },
  {
    "question_id": 41,
    "manually_fixed_correct_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós protegemos os alunos mais jovens.",
    "manually_fixed_incorrect_sentence": "Os alunos mais velhos estavam fazendo bullying com os mais jovens, então nós protegemos os alunos mais velhos.",
    "manually_fixed_correct_switched": "Os alunos mais jovens estavam fazendo bullying com os mais velhos, então nós protegemos os alunos mais velhos.",
    "manually_fixed_incorrect_switched": "Os alunos mais jovens estavam fazendo bullying com os mais velhos, então nós protegemos os alunos mais jovens."
  },
  {
    "question_id": 54,
    "manually_fixed_correct_sentence": "Há uma fenda na parede. É possível enxergar o jardim através da fenda.",
    "manually_fixed_incorrect_sentence": "Há uma fenda na parede. É possível enxergar o jardim através da parede."
  },
  {
    "question_id": 55,
    "manually_fixed_correct_sentence": "Há uma fenda na parede. É possível enxergar o jardim atrás da parede.",
    "manually_fixed_incorrect_sentence": "Há uma fenda na parede. É possível enxergar o jardim atrás da fenda."
  },
  {
    "question_id": 116,
    "manually_fixed_correct_sentence": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará da velha casa na quinta-feira.",
    "manually_fixed_incorrect_sentence": "Joe vendeu sua casa e comprou uma nova a alguns quilômetros de distância. Ele se mudará da nova casa na quinta-feira."
  },
  {
    "question_id": 158,
    "manually_fixed_correct_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abriu seus olhos quando o vento parou.",
    "manually_fixed_incorrect_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abriu seus antebraços quando o vento parou."
  },
  {
    "question_id": 159,
    "manually_fixed_correct_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abaixou seus antebraços quando o vento parou.",
    "manually_fixed_incorrect_sentence": "Fred cobriu seus olhos com os antebraços, porque o vento estava carregando muita areia. Ele abaixou seus olhos quando o vento parou."
  },
  {
    "question_id": 188,
    "manually_fixed_correct_sentence": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer mais biscoitos de aveia.",
    "manually_fixed_incorrect_sentence": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer mais biscoitos com gotas de chocolate.",
    "manually_fixed_correct_switched": "Todo mundo adorou os biscoitos com gotas de chocolate; apenas algumas pessoas gostaram do biscoito de aveia. Da próxima vez, nós deveríamos fazer mais biscoitos com gotas de chocolate.",
    "manually_fixed_incorrect_switched": "Todo mundo adorou os biscoitos com gotas de chocolate; apenas algumas pessoas gostaram do biscoito de aveia. Da próxima vez, nós deveríamos fazer mais biscoitos de aveia."
  },
  {
    "question_id": 189,
    "manually_fixed_correct_sentence": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer menos biscoitos com gotas de chocolate.",
    "manually_fixed_incorrect_sentence": "Todo mundo adorou os biscoitos de aveia; apenas algumas pessoas gostaram do biscoito com gotas de chocolate. Da próxima vez, nós deveríamos fazer menos biscoitos de aveia.",
    "manually_fixed_correct_switched": "Todo mundo adorou os biscoitos com gotas de chocolate; apenas algumas pessoas gostaram do biscoito de aveia. Da próxima vez, nós deveríamos fazer menos biscoitos de aveia.",
    "manually_fixed_incorrect_switched": "Todo mundo adorou os biscoitos com gotas de chocolate; apenas algumas pessoas gostaram do biscoito de aveia. Da próxima vez, nós deveríamos fazer menos biscoitos com gotas de chocolate."
  },
  {
    "question_id": 190,
    "manually_fixed_correct_sentence": "A gente havia planejado colocar cópias da nossa newsletter o sobre todas as cadeiras no auditório, mas não havia o suficiente de cópias da newsletter.",
    "manually_fixed_incorrect_sentence": "A gente havia planejado colocar cópias da nossa newsletter o sobre todas as cadeiras no auditório, mas não havia o suficiente de cadeiras."
  },
  {
    "question_id": 202,
    "manually_fixed_correct_sentence": "John contratou Bill para cuidar de John.",
    "manually_fixed_incorrect_sentence": "John contratou Bill para cuidar de Bill.",
    "manually_fixed_correct_switched": "Bill contratou John para cuidar de Bill.",
    "manually_fixed_incorrect_switched": "Bill contratou John para cuidar de John."
  },
  {
    "question_id": 203,
    "manually_fixed_correct_sentence": "John foi contratado por Bill para cuidar de Bill.",
    "manually_fixed_incorrect_sentence": "John foi contratado por Bill para cuidar de John.",
    "manually_fixed_correct_switched": "Bill foi contratado por John para cuidar de John.",
    "manually_fixed_incorrect_switched": "Bill foi contratado por John para cuidar de Bill."
  },
  {
    "question_id": 208,
    "manually_fixed_correct_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a educação da Emma estava sendo cuidada por uma excelente governanta.",
    "manually_fixed_incorrect_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a educação da mãe da Emma estava sendo cuidada por uma excelente governanta."
  },
  {
    "question_id": 209,
    "manually_fixed_correct_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a casa da mãe da Emma estava sendo cuidada por uma excelente governanta.",
    "manually_fixed_incorrect_sentence": "A mãe da Emma havia morrido fazia muitos anos, e a casa da Emma estava sendo cuidada por uma excelente governanta."
  },
  {
    "question_id": 216,
    "manually_fixed_correct_sentence": "Jim fez um sinal para o barman e apontou para a taça vazia do Jim.",
    "manually_fixed_incorrect_sentence": "Jim fez um sinal para o barman e apontou para a taça vazia do barman."
  },
  {
    "question_id": 217,
    "manually_fixed_correct_sentence": "Jim fez um sinal para o barman e apontou para a chave do banheiro do barman.",
    "manually_fixed_incorrect_sentence": "Jim fez um sinal para o barman e apontou para a chave do banheiro do Jim."
  },
  {
    "question_id": 218,
    "manually_fixed_correct_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Dan foi lento.",
    "manually_fixed_incorrect_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Bill foi lento.",
    "manually_fixed_correct_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque o \"Eu primeiro!\" do Bill foi lento.",
    "manually_fixed_incorrect_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque o \"Eu primeiro!\" do Dan foi lento."
  },
  {
    "question_id": 219,
    "manually_fixed_correct_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Bill foi mais rápido.",
    "manually_fixed_incorrect_sentence": "Dan ficou no banco de trás enquanto Bill reinvidicava a frente porque o \"Eu primeiro!\" do Dan foi mais rápido.",
    "manually_fixed_correct_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque o \"Eu primeiro!\" do Dan foi mais rápido.",
    "manually_fixed_incorrect_switched": "Bill ficou no banco de trás enquanto Dan reinvidicava a frente porque o \"Eu primeiro!\" do Bill foi mais rápido."
  },
  {
    "question_id": 220,
    "manually_fixed_correct_sentence": "Tom disse \"Check\" para Ralph enquanto ele movia o bispo do Tom.",
    "manually_fixed_incorrect_sentence": "Tom disse \"Check\" para Ralph enquanto ele movia o bispo do Ralph.",
    "manually_fixed_correct_switched": "Ralph disse \"Check\" para Tom enquanto ele movia o bispo do Ralph.",
    "manually_fixed_incorrect_switched": "Ralph disse \"Check\" para Tom enquanto ele movia o bispo do Tom."
  },
  {
    "question_id": 221,
    "manually_fixed_correct_sentence": "Tom disse \"Check\" para Ralph enquanto ele tomava o bispo do Ralph.",
    "manually_fixed_incorrect_sentence": "Tom disse \"Check\" para Ralph enquanto ele tomava o bispo do Tom.",
    "manually_fixed_correct_switched": "Ralph disse \"Check\" para Tom enquanto ele tomava o bispo do Tom.",
    "manually_fixed_incorrect_switched": "Ralph disse \"Check\" para Tom enquanto ele tomava o bispo do Ralph."
  },
  {
    "question_id": 228,
    "manually_fixed_correct_sentence": "Bill passou o gameboy para John porque a vez de Bill tinha acabado.",
    "manually_fixed_incorrect_sentence": "Bill passou o gameboy para John porque a vez de John tinha acabado.",
    "manually_fixed_correct_switched": "John passou o gameboy para Bill porque a vez de John tinha acabado.",
    "manually_fixed_incorrect_switched": "John passou o gameboy para Bill porque a vez de Bill tinha acabado."
  },
  {
    "question_id": 229,
    "manually_fixed_correct_sentence": "Bill passou o gameboy para John porque a vez de John era a próxima.",
    "manually_fixed_incorrect_sentence": "Bill passou o gameboy para John porque a vez de Bill era a próxima.",
    "manually_fixed_correct_switched": "John passou o gameboy para Bill porque a vez de Bill era a próxima.",
    "manually_fixed_incorrect_switched": "John passou o gameboy para Bill porque a vez de John era a próxima."
  },
  {
    "question_id": 230,
    "manually_fixed_correct_sentence": "O homem levantou o menino sobre a cabeça do homem.",
    "manually_fixed_incorrect_sentence": "O homem levantou o menino sobre a cabeça do menino.",
    "manually_fixed_correct_switched": "O menino levantou o homem sobre a cabeça do menino.",
    "manually_fixed_incorrect_switched": "O menino levantou o homem sobre a cabeça do homem."
  },
  {
    "question_id": 231,
    "manually_fixed_correct_sentence": "O homem levantou o menino até a beliche do menino.",
    "manually_fixed_incorrect_sentence": "O homem levantou o menino até a beliche do homem.",
    "manually_fixed_correct_switched": "O menino levantou o homem até a beliche do homem.",
    "manually_fixed_incorrect_switched": "O menino levantou o homem até a beliche do menino."
  },
  {
    "question_id": 232,
    "manually_fixed_correct_sentence": "Alongando as costas da mulher, a mulher sorriu para a menina.",
    "manually_fixed_incorrect_sentence": "Alongando as costas da menina, a mulher sorriu para a menina.",
    "manually_fixed_correct_switched": "Alongando as costas da menina, a menina sorriu para a mulher.",
    "manually_fixed_incorrect_switched": "Alongando as costas da mulher, a menina sorriu para a mulher."
  },
  {
    "question_id": 233,
    "manually_fixed_correct_sentence": "Dando um tapinha nas costas da menina, a mulher sorriu para a menina.",
    "manually_fixed_incorrect_sentence": "Dando um tapinha nas costas da mulher, a mulher sorriu para a menina.",
    "manually_fixed_correct_switched": "Dando um tapinha nas costas da mulher, a menina sorriu para a mulher.",
    "manually_fixed_incorrect_switched": "Dando um tapinha nas costas da menina, a menina sorriu para a mulher."
  },
  {
    "question_id": 234,
    "manually_fixed_correct_sentence": "Billy chorou porque Toby não queria aceitar o brinquedo do Billy.",
    "manually_fixed_incorrect_sentence": "Billy chorou porque Toby não queria aceitar o brinquedo do Toby.",
    "manually_fixed_correct_switched": "Toby chorou porque Billy não queria aceitar o brinquedo do Toby.",
    "manually_fixed_incorrect_switched": "Toby chorou porque Billy não queria aceitar o brinquedo do Billy."
  },
  {
    "question_id": 235,
    "manually_fixed_correct_sentence": "Billy chorou porque Toby não queria compartilhar o brinquedo do Toby.",
    "manually_fixed_incorrect_sentence": "Billy chorou porque Toby não queria compartilhar o brinquedo do Billy.",
    "manually_fixed_correct_switched": "Toby chorou porque Billy não queria compartilhar o brinquedo do Billy.",
    "manually_fixed_incorrect_switched": "Toby chorou porque Billy não queria compartilhar o brinquedo do Toby."
  },
  {
    "question_id": 236,
    "manually_fixed_correct_sentence": "Lily conversou com Donna, quebrando a promessa da Lily.",
    "manually_fixed_incorrect_sentence": "Lily conversou com Donna, quebrando a promessa da Donna.",
    "manually_fixed_correct_switched": "Donna conversou com Lily, quebrando a promessa da Donna.",
    "manually_fixed_incorrect_switched": "Donna conversou com Lily, quebrando a promessa da Lily."
  },
  {
    "question_id": 237,
    "manually_fixed_correct_sentence": "Lily conversou com Donna, tirando a concentração da Donna.",
    "manually_fixed_incorrect_sentence": "Lily conversou com Donna, tirando a concentração da Lily.",
    "manually_fixed_correct_switched": "Donna conversou com Lily, tirando a concentração da Lily.",
    "manually_fixed_incorrect_switched": "Donna conversou com Lily, tirando a concentração da Donna."
  },
  {
    "question_id": 240,
    "manually_fixed_correct_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Ollie doíam.",
    "manually_fixed_incorrect_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Tommy doíam.",
    "manually_fixed_correct_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, as pernas do Tommy doíam.",
    "manually_fixed_incorrect_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, as pernas do Ollie doíam."
  },
  {
    "question_id": 241,
    "manually_fixed_correct_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Tommy balançavam.",
    "manually_fixed_incorrect_sentence": "Enquanto Ollie carregava Tommy subindo a longa escada em espiral, as pernas do Ollie balançavam.",
    "manually_fixed_correct_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, as pernas do Ollie balançavam.",
    "manually_fixed_incorrect_switched": "Enquanto Tommy carregava Ollie subindo a longa escada em espiral, as pernas do Tommy balançavam."
  },
  {
    "question_id": 242,
    "manually_fixed_correct_sentence": "O pai carregava o menino dormindo no colo do pai.",
    "manually_fixed_incorrect_sentence": "O pai carregava o menino dormindo no colo do menino."
  },
  {
    "question_id": 243,
    "manually_fixed_correct_sentence": "O pai carregava o menino dormindo no berço do menino.",
    "manually_fixed_incorrect_sentence": "O pai carregava o menino dormindo no berço do pai."
  },
  {
    "question_id": 244,
    "manually_fixed_correct_sentence": "A mulher estava segurando a menina contra o peito da mulher.",
    "manually_fixed_incorrect_sentence": "A mulher estava segurando a menina contra o peito da menina.",
    "manually_fixed_correct_switched": "A menina estava segurando a mulher contra o peito da menina.",
    "manually_fixed_incorrect_switched": "A menina estava segurando a mulher contra o peito da mulher."
  },
  {
    "question_id": 245,
    "manually_fixed_correct_sentence": "A mulher estava segurando a menina contra o desejo da menina.",
    "manually_fixed_incorrect_sentence": "A mulher estava segurando a menina contra o desejo da mulher.",
    "manually_fixed_correct_switched": "A menina estava segurando a mulher contra o desejo da mulher.",
    "manually_fixed_incorrect_switched": "A menina estava segurando a mulher contra o desejo da menina."
  },
  {
    "question_id": 269,
    "manually_fixed_correct_sentence": "Madonna demitiu sua treinadora porque ela dormiu com o namorado da Madonna.",
    "manually_fixed_incorrect_sentence": "Madonna demitiu sua treinadora porque ela dormiu com o namorado da treinadora."
  },
  {
    "question_id": 270,
    "manually_fixed_correct_sentence": "Madonna demitiu sua treinadora porque ela não suportava o namorado da treinadora.",
    "manually_fixed_incorrect_sentence": "Madonna demitiu sua treinadora porque ela não suportava o namorado da Madonna."
  },
  {
    "question_id": 273,
    "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Ovídio; ele foi uma grande influência na escrita de Shakespeare.",
    "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Ovídio; ele foi uma grande influência na escrita de Ovídio."
  },
  {
    "question_id": 274,
    "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Goethe; ele foi uma grande influência na escrita de Goethe.",
    "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Goethe; ele foi uma grande influência na escrita de Shakespeare."
  },
  {
    "question_id": 275,
    "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Ovídio; ele era uma excelente seleção da escrita de Ovídio.",
    "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Ovídio; ele era uma excelente seleção da escrita de Shakespeare."
  },
  {
    "question_id": 276,
    "manually_fixed_correct_sentence": "Este livro introduziu Shakespeare a Goethe; ele era uma excelente seleção da escrita de Shakespeare.",
    "manually_fixed_incorrect_sentence": "Este livro introduziu Shakespeare a Goethe; ele era uma excelente seleção da escrita de Goethe."
  }
]
